[
  {
    "company": "Cvent India Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Senior Software engineer/Software Engineer Cvent, Inc. (www.cvent.com) is the world’s leading provider of cloud-based software for meetings and event management. Our platform of products includes software to manage and facilitate online event registration, meeting site selection, event management, e-mail marketing and web surveys. We also develop mobile apps for both corporate and consumer events. Founded in 1999, we currently have 1,770 talented and dedicated employees and are headquartered just outside of Washington, D.C., in McLean, Virginia, with additional U.S. offices in Portland, Oregon; Austin, Texas, and Los Angeles, California. Internationally we have offices in New Delhi, India and London, England. Cvent has received a number of awards and honors recognizing our strong company culture, innovative products, stellar customer service and support, visionary leadership and investment in our employees. We currently have job openings across all departments and locations and are looking to add valuable team members to further strengthen the company’s DNA Are you passionate about softwares Is coding as much art as it is science? Do you like the challenge of building great products that are feature rich but also easy to use? Would you like to work in a collaborative environment where sharing knowledge and ideas is not only encouraged but expected? If you answered yes to all the above, then you belong at Cvent! We are looking for Software Engineer to join our rapidly growing Technology Team. Cvents Technology Team is responsible for the design, development and operation of the companys suite of cloud-based software products. We are currently engaged in a major initiative to build our next generation software platform, utilizing the most cutting edge tools and technologies. Cvents Technology team offers an opportunity to: Build for Internet scale from get go for us performance, reliability and scalability, are critical design goals not after-thoughts Create beautiful, interactive and easy-to-use web applications. Practice modern tools of the trade Bring cutting edge technologies into production Desired Skills and Experience The prerequisites for joining our development team are simple. We care more about your attitude and aptitude than the specific tools and technologies you have used in the past. You need to be a passionate developer who takes pride in his work. In addition to this, you will have a leg up if you also meet the following criteria: 3-6 years of programming experience in two or more of the following: C/C , VC , Python, C#, Java, ASP.NET, MVC, Ruby on Rails, JavaScript/JQuery, Web Services and API development using REST or SOAP Hands-on experience required for this position. Experience with one or more of the following databases: SQL Server, MySQL, PostgreSQL, Oracle, MongoDB, Redis, Cassandra or other NoSQL technologies B.Tech, M.Tech in Computer Science OR related technical discipline",
    "jobid": 170915500109,
    "joblocation_address": "Gurgaon , Gurgaon , HR , IND",
    "jobtitle": "Senior Software engineer/Software Engineer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-22 22:18:38 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "e9371d0dbfbe5b8e87a215fb83e4e575"
  },
  {
    "company": "Cvent India Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. PG:MBA/PGDM Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "12 - 15 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Cvent, Inc. (www.cvent.com) is the world’s leading provider of cloud-based software for meetings and event management. Our platform of products includes software to manage and facilitate online event registration, meeting site selection, event management, e-mail marketing and web surveys. We also develop mobile apps for both corporate and consumer events. Founded in 1999, we currently have 1,550 talented and dedicated employees and are headquartered just outside of Washington, D.C., in McLean, Virginia, with additional U.S. offices in Portland, Oregon; Austin, Texas, and Los Angeles, California. Internationally we have offices in New Delhi, India, and London, England. Cvent has received a number of awards and honors recognizing our strong company culture, innovative products, stellar customer service and support, visionary leadership and investment in our employees. We currently have job openings across all departments and locations and are looking to add valuable team members to further strengthen the company’s DNA Job Description The Senior Software Development Manager is responsible for managing the specifications, design, and development of large-scale, Internet-based applications. In this role you will work as a leading member of the Product Development team to manage the delivery of scalable, high-performance solutions for transaction-intensive web applications and services. Position Duties Manage Specification, design, development, and debugging of scalable and high-performance service-based web applications Provide leadership and guidance to coach, motivate, and lead team members to their optimum performance levels Manage and/or mentor junior and senior team members of development team Spearhead evaluation and research of latest technologies and actively participate in architectural decisions Coordinate application development projects and production issues with Product Management, Quality Engineering, and Application Support teams Review work of development team to ensure coding standards and best practices are being followed. Also, ensures applications meet performance and security requirements Help continuously improve the software development life cycle processes used Assist in recruiting efforts for development as well as other teams in the Technology department Give performance evaluations and reviews to supervised employees Provide technical guidelines for design and development when needed Performance evaluations and reviews with supervised employees Make decisions that help to evolve the existing software system applications and architecture in various areas as needed. Candidate Requirements B.Tech/B.E Degree in Computer Science MBA or equivalent 12 years of relevant software development and/or project management experience, in a professional environment At least 5 years of management/leadership experience in a global software development organization Prior hands-on experience working through the design, development and release cycle delivering software to market Experience understanding business strategy and how it aligns with technology Strong understanding of the software development cycle Strong leadership, project management skills, time management, and problem solving skills Experience solving complex and large-scale software problems A willingness to dive into software environments and technical issues as part of maintaining the skills necessary to manage and advocate products and projects Ability to work with technical and non-technical business owners to get things done Self-motivation and the ability to work under minimal supervision are a must Excellent oral and written communication skills to interact with all levels in the organization Must be articulate, organized, detail-oriented, and the ability to multi-task in a dynamic, fast-changing entrepreneurial environment This position is expected to work overtime and holidays as needed. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Product Manager Keyskills Senior Engineering Manager Senior Development Manager Desired Candidate Profile Education- UG: B.Tech/B.E. PG:MBA/PGDM Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Cvent India Pvt. Ltd. Cvent India Pvt. Ltd. Download PPT Photo 1   View Contact Details",
    "jobid": 130315500716,
    "joblocation_address": "Gurgaon",
    "jobtitle": "Senior Engineering Manager/Senior Development Manager",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-23 22:17:57 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "d187d440cacc8c7227919109b1f731ea"
  },
  {
    "company": "Cvent India Pvt. Ltd.",
    "education": "UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Corporate Technical Recruiter Position Description We are seeking to add an experienced full-time, Corporate Technical Recruiter to our team. The successful candidate will be responsible for managing the hiring of staff for entry level and experienced technology positions. Detailed responsibilities will include identifying qualified candidates, conducting & scheduling interviews and negotiating employment offers. Position Duties Work closely with technology management to determine hiring needs Identify niche skill candidates based on technical job specifications Source, screen, and interview applicants and maintain candidate information in our Applicant Tracking System. Determine appropriate recruiting sources for advertising and posting positions and promote the company image to candidates and external service providers. Apply thorough knowledge of full lifecycle recruiting to fill positions quickly Network within the technology sector to develop candidate flow Work with universities to establish rapport for direct hires and internships Other duties as assigned to support the Human Resources team Candidate Requirements At least 3 years of experience filling technology positions in a fast paced, full lifecycle recruiting environment. Bachelor\\'s degree required Ideal candidate comes from a corporate recruiting position with a fast growth company, or has an agency background in permanent placements. On-campus recruiting experience is highly desired Candidates should be knowledgeable in internet recruiting techniques, familiar with working with resume management database systems, and skilled at conducting in-depth technical screens. Strong sourcing, screening, and interviewing skills required. The ability to prioritize, manage time well, and work closely with the technology team to quickly address needs and adjust focus as needed. Outstanding oral and written communication skills Ability to contribute ideas for creative recruiting techniques Quick learner, with a positive attitude and ability to work well within a team. Ability to treat sensitive and confidential information with appropriate discretion. Knowledge of the following is helpful: database management systems, SQL, HTML, XML, C#, ASP.NET, IIS, JavaScript. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:Recruitment Executive Keyskills Corporate Technical Recruiter Desired Candidate Profile Education- UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Cvent India Pvt. Ltd. Cvent India Pvt. Ltd. Download PPT Photo 1   View Contact Details",
    "jobid": 130315500725,
    "joblocation_address": "Gurgaon",
    "jobtitle": "Corporate Technical Recruiter",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-23 22:17:48 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "f13ba2d4d961e3a40545f5699148a1ed"
  },
  {
    "company": "Cvent India Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:Post Graduation Not Required Doctorate:Doctorate Not Required",
    "experience": "7 - 10 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Responsibilities will include progressing the transport services provision, handling business user enquiries and complaints, providing Customer focus, managing suppliers and ensuring effective and efficient contract management Manage transport team working across different functional areas and sites. Provide professional and effective transport services to agreed service levels within financial and legislative constraints. Develop relations with internal customers and develop user relations with internal customers. Be responsible for delivering excellent customer satisfaction, building and enhancing a mutually beneficial relationship. Manage the implementation of transport strategy under the direction of Director and the development of the services relations providing line management support and advice for the operational services teams, supplier teams and business users for all service related issues, as appropriate Provide regular reporting and daily MIS and feedback to the Director and as required by management Drive improvements in transport service delivery and any cost reduction opportunities Ensure employee safety and security measures are adequate Ensure adherence to Govt. norms defined with respect to plying of cabs in terms of timings / guard deployment with respect to Lady employees and other statutory related issues Manage the co-ordination and supervision of the following:  Tracking of cabs to ensure on time arrival of cabs, and maintain reports for no shows (with the help of vendor), late boarders, cab movement, waited cabs, on time arrival, first pickup tracking etc. Helpdesk assistance for any query, concern related to transport and resolves the real time issues. Random audit of cab/driver/documents to ensure compliances and prepare reports for the same. Routing of all routes as per changes requested by the employees due to business needs and employee issues. Manage escort guards for female employees to accompany them during odd hours, also maintain tracker for the same. Ensure smooth dispersal of cabs during drop with an eye on availability of vehicles, and prepares report for the same. Generates cab occupancy report, cost saving by clubbing, penalty deductions from transport vendor, vertical wise cost report etc Salary:INR Best in the Industry Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:Administration/Facility Management Role:Transport Manager Keyskills Transportation and Freight Fleet Management Invoice Processing Contract Management Budget Planning Data Management Team Management Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Post Graduation Not Required Doctorate:Doctorate Not Required Please refer to the Job description above Company Profile: Cvent India Pvt. Ltd. Cvent is a leading event management technology company. Cvent offers software solutions to event planners for online event registration, venue selection, event management, mobile apps for events, e-mail marketing and web surveys. Cvent provides hoteliers with an integrated platform, enabling properties to increase group business demand through targeted advertising and improve conversion through proprietary demand management and business intelligence solutions. Cvent solutions optimize the entire event management value chain and have enabled clients around the world to manage hundreds of thousands of meetings and events. Download PPT Photo 1   View Contact Details",
    "jobid": 270416005342,
    "joblocation_address": "Gurgaon",
    "jobtitle": "Assistant Manager Fleet Management (corporate)",
    "numberofpositions": 1,
    "payrate": "Best in the Industry",
    "postdate": "2016-05-03 11:35:41 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "bb8238fd4d2eb84f0e039c1353a13542"
  },
  {
    "company": "Liventus Technology Services Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization, Graduation Not Required, B.Tech/B.E. - Any Specialization, B.Sc - Any Specialization, BCA - Computers PG:Any Postgraduate - Any Specialization, Post Graduation Not Required, MCA - Computers, M.Sc - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "5 - 10 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Position Description: The SQL Database Administrator (DBA) will work closely with our organizations business managers, business users, application developers, and network team to model, design, and monitor database systems (currently MS SQL Server). The SQL DBA role will be responsible for establishing database business rules, maintaining documentation of data and reporting protocols, and assisting in the development and implementation of best practices for the management of databases including the assurance of database policies and procedures, data integrity, data extraction, report customization, and analysis. Job Responsibilities Develop standards and guidelines for use and acquisition of software and to protect vulnerable information Analyze and modify existing databases and database management systems or direct programmers and analysts to make changes Test programs or databases, correct errors, and make necessary modifications Analyze current and implement new security protocols for database access & permissions for applications and users alike, in addition to maintaining detailed security changelogs Approve, schedule, plan, and supervise the installation, maintenance, backups and testing of new products and improvements to database systems Create documentation and train developers and users with best practices Monitor database systems, create baselines & alerts, and proactively fix issues to ensure production database systems work seamlessly Develop data model describing data elements and how they are used, following procedures, and using pen, template, or computer software Develop methods for integrating different products so they work properly together, such as customizing commercial databases to fit specific needs Review project requests describing database user needs to estimate time and cost required to accomplish project Review procedures in database management system manuals for making changes to database Work as part of a project team to coordinate database development and determine project scope and limitations Identify and evaluate industry trends in database systems to serve as a source of information and advice for upper management Revise company definition of data as defined in data dictionary Salary:INR 6,00,000 - 15,00,000 P.A Industry: IT-Software / Software Services Functional Area: IT Software - DBA , Datawarehousing Role Category:Admin/Maintenance/Security/Datawarehousing Role:DBA Keyskills Data Extraction perfomance tuning Mirroring Replication Log Shipping SQL Server Queries Triggers Installation SQL Clustering Restore Backup Statistics Desired Candidate Profile Education- UG: Any Graduate - Any Specialization, Graduation Not Required, B.Tech/B.E. - Any Specialization, B.Sc - Any Specialization, BCA - Computers PG:Any Postgraduate - Any Specialization, Post Graduation Not Required, MCA - Computers, M.Sc - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Qualifications 5+ Years of experience in Database management. Several years of experience working as a hands-on MS SQL Server 2005/2008/2012 Database Administrator Strong skills and experience in performance tuning Index, Table, Queries and Stored procedures. Data modeling skills for enterprise data warehouses and data marts Experience with Triggers, Stored Procedures and SQL Server Queries Experience in a 24/7 high availability production database environment Experience in replication, data warehouse, reporting services, analysis services,scalability and Disaster Recovery Ability to think logically and analyze business process requirements and convert them to accurate database structure and logic Ability to effectively manage multiple concurrent priorities and meet deadlines within an dynamic, fast paced and challenging environment Strong interpersonal and communication skills Strong knowledge designing SSIS packages Strong knowledge of SSRS Experience with one or more Business Intelligence tools Experience with Oracle and other open source databases is a plusBenefits Salary Range: 6-15 Lakh per annum Group Mediclaim policy Accident policy House rent allowance Medical reimbursement Retirement benefits (Provident fund) Gratuity Company Profile: Liventus Technology Services Pvt. Ltd. Liventus offers a complete array of consulting and development services nationwide, including custom software development, eCommerce, mobile technology solutions, and more to fit businesses' and corporations' needs while exceeding expectations. Liventus accepts resumes on a daily basis for full-time or internship positions within the company. Download PPT Photo 1   View Contact Details",
    "jobid": 280616009644,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "SQL Database Administrator",
    "numberofpositions": "",
    "payrate": "6,00,000 - 15,00,000 P.A",
    "postdate": "2016-08-08 18:43:36 +0000",
    "site_name": "",
    "skills": "IT Software - DBA",
    "uniq_id": "88077b056fb30e897bcab8a0ac0a37af"
  },
  {
    "company": "Trigent Software Ltd",
    "education": "UG: B.Tech/B.E. - Any Specialization PG:MCA - Computers Doctorate:Doctorate Not Required",
    "experience": "6 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Looking for SQL Developer with very good hands on experience in SQL Server 2008+ (SQL server 2008, SQL server 2012 and 1016). Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - DBA , Datawarehousing Role Category:Programming & Design Role:Software Developer Keyskills SQL Server Development SQL Server database schema Db stored procedures Triggers troubleshooting Desired Candidate Profile Must have Skills: 2-3 years of experience in designing and/or participating in designing medium and large database 2-3 years of experience at optimizing large complicated SQL statements Participate in discussions involving the application creation and understand the requirements and provide the database schema for the applications 6-8 years of experience in creating Db objects such as tables, views, stored procedures, Triggers etc. 1-2 years of experience in handling SQL server administrative activities such creating users, roles, assigning permissions, maintenance plan Capable of troubleshooting common database issues Knowledge of best practices when dealing with relational databases Ability to work independently and as part of a team Familiar with tools that can aid with profiling server resource usage and optimizing it Should have experience in implementing data security in SQL Server Good knowledge in executing projects using Iterative, Agile methodologies like Scrum Exposure to various open source database tools Experience in using Microsoft Team Foundation Server (TFS) Understand project requirements and document requirements/ client communications Excellent written and oral communication skills, analytical skills, and fanatical attention to detailNice to have Skills: Exposure to SQL Server 2016 Exposure to SQL Server Reporting Services Exposure to SSIS Ability to analyze existing medium size database and come up with recommendation Exposure to Azure cloud Experience in working large team Experience in leading 2-3 developers Knowledge in understanding various UML diagramsOther Skills: Good Oral and Written communication skills, Client Interaction, Good Team Player Individual contributor, should be able to work on assigned tasks independently with little or no guidance.Qualification:BE/BTech/MCAExperience:6-8 Years. Education- UG: B.Tech/B.E. - Any Specialization PG:MCA - Computers Doctorate:Doctorate Not Required Company Profile: Trigent Software Ltd Trigent is an offshore software development and application development company that specializes in creating world-class technology solutions and custom applications for software companies, enterprises, and online business customers. Trigent is a SEI CMM Level 4 and ISO 9001:2000 certified Software Services Company head quartered in Boston, USA. Trigent has attained Microsoft Gold Certified Partner status with its high degree of competency in Microsoft technologies. Download PPT Photo 1   View Contact Details",
    "jobid": 101016900004,
    "joblocation_address": "Bengaluru",
    "jobtitle": "Sr. SQL Server Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-10 16:21:21 +0000",
    "site_name": "",
    "skills": "IT Software - DBA",
    "uniq_id": "54596b08dc3bc29cd20530154e1c093d"
  },
  {
    "company": "Cvent India Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization, B.Tech/B.E. - Any Specialization, Diploma - Any Specialization, B.Sc - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Position Duties: Understand and conceptualize clients design requirement, turn it into the reality on their website designing projects via email or verbal communication with client Act as a project manager and maintain strong communication with clients and other project stakeholders Make managerial decisions whenever required and act as a team player by providing excellent design solution as an individual contributor. Salary:INR Best in the Industry Industry: IT-Software / Software Services Functional Area: IT Software - Other Role Category:Programming & Design Role:Graphic/Web Designer Keyskills Web design Graphic Designing html CSS HTML 5 photoshop 5 javascript 5 ajax 5 css 5 dreamweaver 5 flash 5 Desired Candidate Profile Education- UG: Any Graduate - Any Specialization, B.Tech/B.E. - Any Specialization, Diploma - Any Specialization, B.Sc - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Candidate Requirements:Excellent web designing capabilities with high level of creativityExcellent verbal and written communication skillsAt least 2 years of professional experience as a Web/UI designer or on a similar roleExpert level of proficiency on Adobe Dreamweaver and PhotoshopHigh level of comfort using jQuery and JavaScript library module implementationsStrong sense of colour combination, aesthetics, typography, interactivity etc.Proficiency in HTML5 and CSS3 will be a plusBachelor Degree in Multimedia/Web development, BFA/MFA will be given preferenceBenefits:AC Cabs both sidesFree mealsMedical Insurance Company Profile: Cvent India Pvt. Ltd. Cvent, Inc. (www.cvent.com) is the world's leading provider of cloud-based software for meetings and event management. Our platform of products includes software to manage and facilitate online event registration, meeting site selection, event management, e-mail marketing and web surveys. We also develop mobile apps for both corporate and consumer events. Founded in 1999, we currently have 1250+ talented and dedicated employees and are headquartered just outside of Washington, D.C., in McLean, Virginia, with additional U.S. offices in Portland, Oregon; Austin, Texas, and Los Angeles, California. Internationally we have offices in New Delhi, India, and London, England. Cvent has received a number of awards and honors recognizing our strong company culture, innovative products, stellar customer service and support, visionary leadership and investment in our employees. We currently have job openings across all departments and locations and are looking to add valuable team members to further strengthen the company's DNA. Download PPT Photo 1   View Contact Details",
    "jobid": "030516008306",
    "joblocation_address": "Gurgaon",
    "jobtitle": "Web Designer & Graphic Designer (work Timings--6:30 pm - 3:30 am IST)",
    "numberofpositions": 5,
    "payrate": "Best in the Industry",
    "postdate": "2016-05-03 11:35:42 +0000",
    "site_name": "",
    "skills": "IT Software - Other",
    "uniq_id": "16e5b7b9e888b989a472db3765978b01"
  },
  {
    "company": "Telerad Tech Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "5 - 10 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this 5 years SQL Server (sql server 2005 , sql server 2008 ) experience interfacing with database objects through program applications (i. e. . NET ). Responsible for developing and maintaining a high performance database for a healthcare application. This person will be expected to learn the functional requirements, Architect & Implement database structures to deliver high performance, define data extraction approaches and implement a comprehensive database architectural structure. His earlier roles should have included: Monitor and improve database performance including server level performance Define policies for database schema. Manage Security and access policies Maintenance of a Database which is large in size and is running under SQL Server 2005 with SSRS, SSIS, etc. Identify the data, business, technical, process and project components of comprehensive database architecture. Responsible for architecting and implementing a database that supports high demand web sites and services. Responsible for preparing test strategies, database scripts and conducting system tests and documentation. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Database Architect/Designer Keyskills ajax ssis ssrs documentation healthcare schema maintaining data extraction policies sql server 2005 Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Telerad Tech Pvt. Ltd. Telerad Tech Pvt. Ltd. Download PPT Photo 1   View Contact Details",
    "jobid": 250915500434,
    "joblocation_address": "Bengaluru/Bangalore , Bengaluru / Bangalore",
    "jobtitle": "Database Architect",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-01-29 14:07:46 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "d227d6c5e22ac292ea407f3d11e895ae"
  },
  {
    "company": "Cvent India Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "5 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this New Page 1 Manager, Information Security Job Description: As part of the Global IT Security Team the Manager of Information Security will be responsible for ensuring our company, people, process, technology, applications, and architectures are properly secured. Additional responsibilities include review and correlation of security events, performing root cause analysis, and escalation and investigation of security incidents. This is a highly visible position, as you will work and support other teams to ensure Information Security is seen as a positive advantage to the business, not just compliance, and you will provide inputs into future strategy and other areas of the wider IT Assurance remit. Scope: Working primarily in the Gurgaon office, and across worldwide Cvent locations as needed Core Skills: Ability to appropriately articulate security concepts to the business and IT Ability to develop sound relationships with service team leaders, other IT functions and other departments Ability to update skills and knowledge relating to future trends in technology and industry standards Ability to take a structured, methodical, disciplined approach to procedures Ability to effectively communicate security issues and concepts to technical teams Ability to effectively coach and mentor all levels of staff on the India Information Security team Mandatory: Excellent verbal and written English communication skills are most important for the role. Excellent documentation, analysis, problem solving, and planning skills with a flexible approach to challenges Solid understanding of IT Security and Architecture reviews Solid understanding of OS (Unix/ Linux, Windows, OSX) , IPS/ IDS, VPN, Firewalls, Web Application Firewalls, Application Security, Network Security Experience with handling and mitigating security incidents such as virus, spoofing, malware attacks Familiarity with emerging security threats and their attack vectors Familiarity with Penetration Testing & Vulnerability Assessments Educational qualifications: B.E, B. Tech, M.E, M. Tech (no arts, commerce, science graduates please) Accredited Security Certification (i.e. CISSP, CISM, CISA) Compliance experience: ISO27001/ PCI/ SOX Desirable : Hands- on investigation and log analysis exposure Exposure to multi- location enterprise class commercial data center and cloud infrastructure setups Experience: hands- on 5 years Management: 2 years Security Tools Configuration experience Send to a Friend Please wait... Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Network Administration , Security Role Category:Admin/Maintenance/Security/Datawarehousing Role:System Security Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Cvent India Pvt. Ltd. Cvent India Pvt. Ltd. Download PPT Photo 1   View Contact Details",
    "jobid": 270516500433,
    "joblocation_address": "Gurgaon",
    "jobtitle": "Manager, Information Security",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-05-27 16:23:39 +0000",
    "site_name": "",
    "skills": "IT Software - Network Administration",
    "uniq_id": "056a61a02ce5b190eb867d9dfa62bf35"
  },
  {
    "company": "Sepal Technologies Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Job Description :1. Extensive Knowledge of SQL Server 2005 / 2008. 2. Ability to create complex SQL queries, stored procedures, SQL profiler, functions, triggers, views, tables & indexes, Schema, Security, SSIS packages, DTS packages. 3. Hands on experience in database optimization and tuning. 4. Knowledge of relational database concepts. 5. Knowledge on SSRS ( SQL Server Reporting Services) is mustDesired Experience :1. Good coding experience. 2. Microsoft Certification is a plus point. 3. Good communication skills. 4. Should have Analytical blend of mind. 5. Able to work in dynamic and challenging environment p> p> Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills sql server ssis ssrs coding stored procedures triggers optimization dts functions tuning Desired Candidate Profile Education- UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Sepal Technologies Pvt. Ltd. Sepal Technologies Pvt. Ltd. Download PPT Photo 1   View Contact Details",
    "jobid": 131015500533,
    "joblocation_address": "Delhi",
    "jobtitle": "Database Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-23 22:18:00 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "cb92aa1153997e9970c595d098a76a43"
  },
  {
    "company": "Technosoft Global Services Pvt Ltd",
    "education": "UG: Any Graduate - Any Specialization",
    "experience": "4 - 9 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Hi, Greeting Form Technosoft..!! Technosoft Corporation, Bangalore is conducting a walkin drive tomorrow i.e. 11th October (Tuesday). Interested candidates can walkin to attend the interview starting from 10 AM at the below mentioned venue. Technosoft Corporation Cessna Business Park, Embassy Tech Square, 3rd Floor. Signet Building. Bangalore. phno:08042451532   This position is a Permanent employment with Technosoft. We are looking for a recruiter, with full cycle recruiting experience, to attract, screen, select and onboard qualified and suitable personnel to fill our job openings. The goal is to attract top talent from our candidates pool, gain competitive advantage and fuel companys growth. Position: IT Recruiter Location: Bangalore Notice Period: 15 Days Responsibilities Design and implement overall recruiting strategy Develop and update job descriptions and job specifications Perform job and task analysis to document job requirements and objectives Prepare and post jobs to appropriate job board/newspapers/colleges etc Source and attract candidates by using databases, social media etc Screen candidates resumes and job applications Conduct interviews using various reliable personnel selection tools/methods to filter candidates within schedule Assess applicants relevant knowledge, skills, soft skills, experience and aptitudes Onboard new employees in order to become fully integrated Monitor and apply hr recruiting best practices Provide analytical and well documented reports to the rest of the team Act as a point of contact and build influential candidate relationships during the selection process Promote companys reputation as best place to work EXPERTISE IN CONTRACT STAFFING IS MUST Requirements Proven work experience as a recruiter Solid ability to conduct different types of interviews (structured, competency based, stress etc) Hands on experience with various selection processes (phone interviewing, reference check etc) Ability to organise assessment centers (in tray activities, work samples, psychometric and IQ/EQ tests etc) Familiarity with hr databases, applicant tracking systems and CMS Excellent communication and interpersonal skills Strong decision making skills BS/MS in Human Resources Management Please mention  Deepa on top of your resume. Contact person - Vinod Note: 1) P ls bring the print out of this job post along with you for interview. 2) carry your original ID proof. Salary: Attractive Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:Recruitment Executive Keyskills it recruiter recruitment executive contract staffing hr recruiter mba hr bba hr human resources recruitments Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization Company Profile: Technosoft Global Services Pvt Ltd Technosoft Corporation is an ISO 9001:27001 company, founded in 1996 as an Information Technology (IT) /Business Process Outsourcing (BPO) Services Company. Headquartered in Michigan, USA, Technosoft has 10 offices globally. Outsourcing operations are located at our state-of-the-art facility in Chennai and Bangalore, India. Since its inception in 1996, Technosoft has seen unprecedented yet consistent growth in terms of customers, employees and revenue. Currently, Technosoft has over 1800 employees across the world. Our customers include Fortune 1000 and SMB companies globally. For further information, do check our website www.technosoftcorp.com. Download PPT Photo 1   View Contact Details",
    "jobid": 101016005604,
    "joblocation_address": "Bengaluru",
    "jobtitle": "IT Recruiter,bangalore",
    "numberofpositions": 20,
    "payrate": "Attractive",
    "postdate": "2016-10-10 16:21:02 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "926b3bc10b34c38de360c7113f4993a6"
  },
  {
    "company": "Technosoft Global Services Pvt Ltd",
    "education": "UG: Any Graduate - Any Specialization",
    "experience": "4 - 9 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Hi, Greeting Form Technosoft..!! Technosoft Corporation, Bangalore is conducting a walkin drive tomorrow i.e. 11th October (Tuesday). Interested candidates can walkin to attend the interview starting from 10 AM at the below mentioned venue. Technosoft Corporation Cessna Business Park, Embassy Tech Square, 3rd Floor. Signet Building. Bangalore.   This position is a Permanent employment with Technosoft. We are looking for a recruiter, with full cycle recruiting experience, to attract, screen, select and onboard qualified and suitable personnel to fill our job openings. The goal is to attract top talent from our candidates pool, gain competitive advantage and fuel companys growth. Position: IT Recruiter Location: Bangalore Notice Period: 15 Days Responsibilities Design and implement overall recruiting strategy Develop and update job descriptions and job specifications Perform job and task analysis to document job requirements and objectives Prepare and post jobs to appropriate job board/newspapers/colleges etc Source and attract candidates by using databases, social media etc Screen candidates resumes and job applications Conduct interviews using various reliable personnel selection tools/methods to filter candidates within schedule Assess applicants relevant knowledge, skills, soft skills, experience and aptitudes Onboard new employees in order to become fully integrated Monitor and apply hr recruiting best practices Provide analytical and well documented reports to the rest of the team Act as a point of contact and build influential candidate relationships during the selection process Promote companys reputation as best place to work EXPERTISE IN CONTRACT STAFFING IS MUST Requirements Proven work experience as a recruiter Solid ability to conduct different types of interviews (structured, competency based, stress etc) Hands on experience with various selection processes (phone interviewing, reference check etc) Ability to organise assessment centers (in tray activities, work samples, psychometric and IQ/EQ tests etc) Familiarity with hr databases, applicant tracking systems and CMS Excellent communication and interpersonal skills Strong decision making skills BS/MS in Human Resources Management Please mention  \"James Jacob\"  on top of your resume. Contact person - Vinod Note: 1) P ls bring the print out of this job post along with you for interview. 2) carry your original ID proof. Salary: Attractive Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:Recruitment Executive Keyskills it recruiter recruitment executive contract staffing hr recruiter mba hr bba hr human resources recruitments Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization Company Profile: Technosoft Global Services Pvt Ltd Technosoft Corporation is an ISO 9001:27001 company, founded in 1996 as an Information Technology (IT) /Business Process Outsourcing (BPO) Services Company. Headquartered in Michigan, USA, Technosoft has 10 offices globally. Outsourcing operations are located at our state-of-the-art facility in Chennai and Bangalore, India. Since its inception in 1996, Technosoft has seen unprecedented yet consistent growth in terms of customers, employees and revenue. Currently, Technosoft has over 1800 employees across the world. Our customers include Fortune 1000 and SMB companies globally. For further information, do check our website www.technosoftcorp.com. Download PPT Photo 1   View Contact Details",
    "jobid": 101016005556,
    "joblocation_address": "Bengaluru",
    "jobtitle": "Senior IT Recruiter,bangalore",
    "numberofpositions": 20,
    "payrate": "Attractive",
    "postdate": "2016-10-10 16:21:08 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "c3af9b76287dada4bb77fe1f0626c00b"
  },
  {
    "company": "Technosoft Global Services Pvt Ltd",
    "education": "UG: Any Graduate - Any Specialization",
    "experience": "4 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Hi, Greeting Form Technosoft..!! Technosoft Corporation, Bangalore is conducting a walkin drive from11th October (Tuesday) to 13th October (Thursday). Interested candidates can walkin to attend the interview starting from 10 AM to 4PM at the below mentioned venue. Technosoft Corporation Cessna Business Park, Embassy Tech Square, 3rd Floor. Signet Building. Bangalore.   This position is a Permanent employment with Technosoft. We are looking for a recruiter, with full cycle recruiting experience, to attract, screen, select and onboard qualified and suitable personnel to fill our job openings. The goal is to attract top talent from our candidates pool, gain competitive advantage and fuel companys growth. Position: IT Recruiter Location: Bangalore Notice Period: 15 Days Responsibilities Design and implement overall recruiting strategy Develop and update job descriptions and job specifications Perform job and task analysis to document job requirements and objectives Prepare and post jobs to appropriate job board/newspapers/colleges etc Source and attract candidates by using databases, social media etc Screen candidates resumes and job applications Conduct interviews using various reliable personnel selection tools/methods to filter candidates within schedule Assess applicants relevant knowledge, skills, soft skills, experience and aptitudes Onboard new employees in order to become fully integrated Monitor and apply hr recruiting best practices Provide analytical and well documented reports to the rest of the team Act as a point of contact and build influential candidate relationships during the selection process Promote companys reputation as best place to work EXPERTISE IN CONTRACT STAFFING IS MUST Requirements Proven work experience as a recruiter Solid ability to conduct different types of interviews (structured, competency based, stress etc) Hands on experience with various selection processes (phone interviewing, reference check etc) Ability to organise assessment centers (in tray activities, work samples, psychometric and IQ/EQ tests etc) Familiarity with hr databases, applicant tracking systems and CMS Excellent communication and interpersonal skills Strong decision making skills BS/MS in Human Resources Management Please mention \"ASHA RANI\" on top of your resume. Contact person - Vinod Note: 1) P ls bring the print out of this job post along with you for interview. 2) carry your original ID proof. Salary: Attractive Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:Recruitment Executive Keyskills it recruiter recruitment executive contract staffing hr recruiter mba hr bba hr human resources recruitments Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization Company Profile: Technosoft Global Services Pvt Ltd Technosoft Corporation is an ISO 9001:27001 company, founded in 1996 as an Information Technology (IT) /Business Process Outsourcing (BPO) Services Company. Headquartered in Michigan, USA, Technosoft has 10 offices globally. Outsourcing operations are located at our state-of-the-art facility in Chennai and Bangalore, India. Since its inception in 1996, Technosoft has seen unprecedented yet consistent growth in terms of customers, employees and revenue. Currently, Technosoft has over 1800 employees across the world. Our customers include Fortune 1000 and SMB companies globally. For further information, do check our website www.technosoftcorp.com. Download PPT Photo 1   View Contact Details",
    "jobid": 101016004358,
    "joblocation_address": "Bengaluru",
    "jobtitle": "Sr.it Recruiter",
    "numberofpositions": 20,
    "payrate": "Attractive",
    "postdate": "2016-10-10 16:21:21 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "0154e0092590c9f3e10f10acd0113d27"
  },
  {
    "company": "Technosoft Global Services Pvt Ltd",
    "education": "UG: Any Graduate - Any Specialization",
    "experience": "3 - 7 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Hi, Greeting Form Technosoft..!! This position is a Permanent employment with Technosoft. We are looking for a recruiter, with full cycle recruiting experience, to attract, screen, select and onboard qualified and suitable personnel to fill our job openings. The goal is to attract top talent from our candidates pool, gain competitive advantage and fuel companys growth. Position: IT Recruiter Location: Bangalore Notice Period: 15 Days Responsibilities Design and implement overall recruiting strategy Develop and update job descriptions and job specifications Perform job and task analysis to document job requirements and objectives Prepare and post jobs to appropriate job board/newspapers/colleges etc Source and attract candidates by using databases, social media etc Screen candidates resumes and job applications Conduct interviews using various reliable personnel selection tools/methods to filter candidates within schedule Assess applicants relevant knowledge, skills, soft skills, experience and aptitudes Onboard new employees in order to become fully integrated Monitor and apply hr recruiting best practices Provide analytical and well documented reports to the rest of the team Act as a point of contact and build influential candidate relationships during the selection process Promote companys reputation as best place to work CONTRACT STAFFING EXPERIENCE IS MUST Requirements Proven work experience as a recruiter Solid ability to conduct different types of interviews (structured, competency based, stress etc) Hands on experience with various selection processes (phone interviewing, reference check etc) Ability to organise assessment centers (in tray activities, work samples, psychometric and IQ/EQ tests etc) Familiarity with hr databases, applicant tracking systems and CMS Excellent communication and interpersonal skills Strong decision making skills BS/MS in Human Resources Management Interested candidates can share their profiles to me at asha.rani@technosoftcorp.com Salary: Attractive Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:Recruitment Executive Keyskills it recruiter recruitment executive contract staffing hr recruiter mba hr bba hr human resources recruitments staffing Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization Company Profile: Technosoft Global Services Pvt Ltd Technosoft Corporation is an ISO 9001:27001 company, founded in 1996 as an Information Technology (IT) /Business Process Outsourcing (BPO) Services Company. Headquartered in Michigan, USA, Technosoft has 10 offices globally. Outsourcing operations are located at our state-of-the-art facility in Chennai and Bangalore, India. Since its inception in 1996, Technosoft has seen unprecedented yet consistent growth in terms of customers, employees and revenue. Currently, Technosoft has over 1800 employees across the world. Our customers include Fortune 1000 and SMB companies globally. For further information, do check our website www.technosoftcorp.com. Download PPT Photo 1   View Contact Details",
    "jobid": 101016004468,
    "joblocation_address": "Bengaluru",
    "jobtitle": "Job Opportunity for IT Recruiter,bangalore",
    "numberofpositions": 20,
    "payrate": "Attractive",
    "postdate": "2016-10-10 16:21:12 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "e7481d2ea5ae74d2871b5f3f6b8a60ac"
  },
  {
    "company": "AAS TECHNOSOFT PVT LTD",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "5 - 10 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this * Job Description : Project Manager in healthcare systems. Candidates should have experience in Microsoft and / or Oracle technologies. Minimum 5 years experience in developing Hospital Management Systems and relevant domain experience in the healthcare segment. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Project Management Role:Project Manager-IT/Software Keyskills oracle microsoft healthcare hospital management project manager management systems domain developing experience Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AAS TECHNOSOFT PVT LTD AAS Technosoft Pvt Ltd is a technology focused IT company incorporated in financial year 2010-11 with a motto to deliver Lean and Intelligent technology solutions to our Customers through a very Energetic and smart team of professionals. Download PPT Photo 1   View Contact Details",
    "jobid": 150715503723,
    "joblocation_address": "Ghaziabad",
    "jobtitle": "Project Manager",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-22 22:18:29 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "c684eb96bfc756647f567e2fa6ce08fb"
  },
  {
    "company": "AAS Technosoft Pvt Ltd",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Job Description Urgent requirement for .Net or Java 2.0 / J2EE based projects to be executed on - site and offshore for USA based clients. Candidates with 5 years experience and minimum 3 years in Microsoft or Java / Websphere / J2EE based projects Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills j2ee microsoft offshore java 2 0 websphere net be executed usa clients Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AAS Technosoft Pvt Ltd AAS Technosoft Pvt Ltd is a technology focused IT company incorporated in financial year 2010-11 with a motto to deliver Lean and Intelligent technology solutions to our Customers through a very Energetic and smart team of professionals. Download PPT Photo 1   View Contact Details",
    "jobid": 150715503814,
    "joblocation_address": "Ghaziabad",
    "jobtitle": "Senior Developers/Design Architects",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-22 22:18:41 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "981b4983a9ee63ac8af13034c45220f5"
  },
  {
    "company": "Millennium Technosoft Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "4 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Hi We have an urgent requirement for our client TechM for Qlickview Developer. NOTE: Without passport please do not apply. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Millennium Technosoft Ltd. Millennium Technosoft (www.mtslindia.com ) is one of the leading IT Staffing and IT Solutions companies, offering technology expertise to our customers in various domains. Established in the year 1995, we have geographical presence in India, United States and South Africa with over 320 employees Download PPT Photo 1   View Contact Details",
    "jobid": 170316600460,
    "joblocation_address": "Hyderabad / Secunderabad",
    "jobtitle": "Qlickview Developer",
    "numberofpositions": 10,
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-16 02:30:22 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "07215172bddc0f19b530f79c2c838af5"
  },
  {
    "company": "Millennium Technosoft Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "0 - 0 yrs",
    "industry": "Medical / Healthcare / Hospitals",
    "jobdescription": "Job Description   Send me Jobs like this Hi This is prabhu from Millennium Technosoft Ltd. We are hiring Freshers with Science Background in our Company. Interested Candidates can come in for a Walk-in Interview today and tomorrow between 2:30 PM to 6 PM. Venue Details: #202, Fortune Chambers, Image Function Hall Lane, Opp. HDFC Bank, Madhapur, Hyderabad. Salary: Not Disclosed by Recruiter Industry: Medical / Healthcare / Hospitals Functional Area: IT Software - Application Programming , Maintenance Role Category:Other Role:Fresher Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Millennium Technosoft Ltd. Millennium Technosoft (www.mtslindia.com) is one of the leading IT Staffing and IT Solutions companies, offering technology expertise to our customers in various domains. Established in the year 1995, we have geographical presence in India, United States and South Africa with over 320 employees. Download PPT Photo 1   View Contact Details",
    "jobid": 180316600936,
    "joblocation_address": "Hyderabad / Secunderabad",
    "jobtitle": "We are Hiring Freshers with Science Background in our Company",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-17 02:30:57 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "d2a18c140ac5ce8dc507a0cb15a14190"
  },
  {
    "company": "JK Technosoft Ltd",
    "education": "",
    "experience": "4 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this We are expanding JAVA practice at our Bangalore office. If interested, please send me updated resume along with below details : Total IT experience     : Relevant experience : Current CTC                : Expected CTC             : Notice period               : Job Description : Experience : 4 - 6 years Job Location: Bengaluru/Bangalore Role : JAVA/J2EE Developer Looking for a JAVA/J2EE developer who is a dynamic individual looking to join the IT professionals team at JK Technosoft based in Bangalore (India). The successful candidate will work directly with industry executives to design, build, and deploy many of our industry leading business systems. Skills: Minimum 4-6 years of experience in web based Java application development. Strong technical expertise on JAVA, J2EE, Spring, Hibernate, Web services, JMS, XML, REST web services technologies, SQL. Should be able to understand the business drivers and functional context behind problem statement and deliver. Prior hands on experience on developing products/frameworks using java, J2EE technologies, Spring, Hibernate, web services. Should have very good understanding of technology best practices to be followed in agile development methodology. Should have demonstrated success delivering large scale, complex applications in reputed organizations. Functional knowledge in FMCG sector operations or prior experience in any distributor management system will be an added advantage. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Java Spring Hibernate JMS J2Ee Rest Web Services XML SQL Agile Development Desired Candidate Profile Please refer to the Job description above Company Profile: JK Technosoft Ltd JK Technosoft (JKT) is a global software &amp; solutions company that is driven by the simple yet powerful tenet of providing 'total customer satisfaction'. A valuable asset of the JK Organization, one of India's largest industrial groups with an annual turnover exceeding US$ 4 billion, JKT is at the leading edge of comprehensive IT services &amp; solutions. JKT offers a wide breadth of services across the entire Information Technology spectrum including Enterprise Solutions, Progress Consulting, Application Management, Product Management, Independent Testing and Professional Services. Its exceptional and exhaustive domain expertise in verticals such as automotive, healthcare, consumer goods and cement has nurtured an exclusive client roster spread across Europe, US, Australia and Asia-Pacific. Since its inception in 1994, JKT has achieved exceptional growth. Over 650 top rung professionals, ISO 9001 &amp; ISO 27001 certifications, development centers in Noida (Delhi/NCR) and Bangalore, a sales office in Mumbai, and 100% subsidiary companies based in UK and US Ã¢ï¿½ï¿½ are testimony to this. JKT has established a separate subsidiary, JKT Consulting (JKTC) to provide consulting and implementation services to selected industry verticals. JKTC provides end-to-end business solutions to both Indian as well as global clients, bringing in high value consulting, technology implementation &amp; education solutions. The focused industry verticals are Retail, Consumer Goods, Healthcare and Cement. JKT is SAP Service, Channel &amp; Education partner. Download PPT Photo 1   View Contact Details",
    "jobid": "071016004129",
    "joblocation_address": "Bengaluru",
    "jobtitle": "Java Developers - JK Technosoft",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-07 16:21:24 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "a19674e5ae5ed5f3dac6fa6d930016cd"
  },
  {
    "company": "AAS Technosoft Pvt Ltd",
    "education": "UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "1 - 3 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Job Description : Extensive knowledge in Search Engine Optimization and Pay Per Click On- Page Optimization with knowledge in HTML & CSS Off- page Optimization (Directory Submission, Article Submission, Blog and Press Release Posting, Forum Thread Creation & Reciprocal Link Building) Should be good at English (both Written & Spoken) Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: Marketing , Advertising , MR , PR , Media Planning Role Category:Marketing Role:Direct Marketing Executive Desired Candidate Profile Education- UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AAS Technosoft Pvt Ltd AAS Technosoft Pvt Ltd Download PPT Photo 1   View Contact Details",
    "jobid": "031215500277",
    "joblocation_address": "Mumbai , Mumbai",
    "jobtitle": "SEO Professionals",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-12-29 02:23:53 +0000",
    "site_name": "",
    "skills": "Marketing",
    "uniq_id": "2d61edd4da98504c0ea258aa0a4fd1a3"
  },
  {
    "company": "Ecentric Solutions Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required",
    "experience": "5 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this - 5+ years professional web application development and deployment - Expert Python with Python application sever - Strong working experience with Relational Database (PostgreSQL) and NoSQL (DynamicDB or MongoDB) - Strong working experience with Django, Rest Framework, API development, JSON, and Workflow - Knowledge of scaling, optimization, partitioning, fault tolerance and deployment issues - Strong data modeling working experience - Good communication skills - Working experience with Git - Working experience with AWS message queueing and Celery Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Python Django NoSQL MongoDB GIT Postgresql Rest Web Application Development Data Modeling Python Developer Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required   Company Profile: Ecentric Solutions Pvt. Ltd. Ecentric Solutions Pvt. Ltd. Download PPT Photo 1   View Contact Details",
    "jobid": 280316900752,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Python Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-30 17:04:39 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "e10b6a28c61fa1f32caa967bd79f1f03"
  },
  {
    "company": "Independent Consultant",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required",
    "experience": "2 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Title: Python / Django Developer Reports to: Lead Developer Objective: Design, develop, test and implement high quality applications as a member of an agile Development team. Scope: As a fullstack developer, you'll be writing high performing Python/JS code that frequently deploys to production, you'll make key architectural decisions and solve challenging problems that add real value to the end user. Your responsibilities may include: - The job involves designing and developing of solutions as part of a software development process. - The job has significant technical content and the candidate is expected to write good quality Python/Django code. - Design, develop, test and implement high quality software, as a member of an agile development team. - Participating in code reviews, design reviews architecture discussions. - Proactively identifying architectural weaknesses and recommending appropriate solutions. - Proactively share technical knowledge and best practices with team members Engage in continuous learning and adoption of new concepts, technologies and functionality. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Django Python Javascript Agile Development Software Development End User Django Developer Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required Desired Skills & Experience- 2+ years experience in developing apps using Python / Django.- Strong OOPS design and programming skills in Python.- Proficient in HTML5, Javascript, and CSS.- Excellent understanding of jQuery, AngularJS, and Bootstrap. Company Profile: Independent Consultant Leading client of Independent Consultant. Download PPT Photo 1   View Contact Details",
    "jobid": "050816900295",
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Python/ Django Developer - Javascript/ Angularjs",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-08-06 18:44:03 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "9a30c9166d39a49d78f67d4a8f48e70f"
  },
  {
    "company": "Confidential",
    "education": "",
    "experience": "5 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Experience : 5 to 8 Location : Bangalore Job Description: Python with experience in Financial Industry Thorough understanding of Python basic concepts like Lists, Strings, Indexing, Slicing, Tuples and Dictionaries. Object Oriented concepts like creating classes, constructors, overloading and modules Familiar with NumPy and Pandas . Note : Quick Joiners with maximum of 20 days notice period are only accepted. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills python django python Developer Desired Candidate Profile   Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": 310516004758,
    "joblocation_address": "Bengaluru",
    "jobtitle": "Opportunity In Python Development",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-07 16:21:29 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "db549ea6c3a07a4af233ecdb6173c7ee"
  },
  {
    "company": "Magna HR Consultant",
    "education": "UG: B.Tech/B.E. - Computers PG:M.Tech - Electrical, M.Sc - Computers Doctorate:Doctorate Not Required",
    "experience": "2 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this We are looking for folks who: Education :- B.E / B.Tech / M.E / M.Tech / M.S in Computer Science, Electronics or related fields from a premier institute Experience :- 2-5 years of work experience, having demonstrated problem solving skills Have experience designing and implementing non-trivial software systems (e.g., using multiple processes/threads/IPC etc.) 1. Expertise in Python 2. Working knowledge of Linux and Unix 3. Proficiency in Shell scripting 4. Exposure to Flask/Django framework is preferred 5. Experience in Algorithmic development 6. 2-5 years of work experience 7. Good understanding of version control system 8. Exposure to various databases and associated technologies like Postgresql, Redis etc. Will be an added advantage Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Python Django Unix Linux Shell Scripting IPC Postgresql Version Control Control System Computer Science Desired Candidate Profile Education- UG: B.Tech/B.E. - Computers PG:M.Tech - Electrical, M.Sc - Computers Doctorate:Doctorate Not Required Please refer to the Job description above Company Profile: Magna HR Consultant Leading client of Magna HR Consultant Download PPT Photo 1   View Contact Details",
    "jobid": 170316001558,
    "joblocation_address": "Delhi/NCR(National Capital Region) , Gurgaon",
    "jobtitle": "Python Developer - Django - Linux/unix",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-19 06:05:54 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "8d4f2ceba4e35d97cf0e0c8144074ee9"
  },
  {
    "company": "Confidential hiring for CMM Level5",
    "education": "",
    "experience": "3 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Experience: 3-5Yrs Location: Bangalore Required skills: C++ (Mandatory) * Unix Application Programming * Python Scripting Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills C++ Python Unix Application Programming Desired Candidate Profile Please refer to the Job description above Company Profile: Confidential CMM Level5 Confidential Download PPT Photo 1   View Contact Details",
    "jobid": "090716002083",
    "joblocation_address": "Bengaluru",
    "jobtitle": "C++, Unix Application Programming, Python Scripting",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-07 16:21:26 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "eadd82ba5e1debc27db3ec728525bb55"
  },
  {
    "company": "Confidential",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate",
    "experience": "3 - 7 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Job Title: UI- Designer & Developer Experience: 3 7 Yrs Location: Bangalore Job Description: Very Good in Dojo or any other Javascript libraries. Good in Ajax, Javascript, HTML concepts. Angular JS, JSON, Java script, Ajax, HTML CSS and any knowledge on python or Django sever would be added advantage. Jboss drools. Design Patterns. Good in oops and Data strcutures. XML parsers, Xpath, XSLT and JAXB. We are looking for someone who can join within 60 days. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Graphic/Web Designer Keyskills HTML CSS Javascript Ajax Python User Interface Designing JSON XML Django Dojo UI Designer Desired Candidate Profile   Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": "050916901074",
    "joblocation_address": "Bengaluru",
    "jobtitle": "UI Designer/ Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-10 16:21:01 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "5cd1303776de4373e855867574ff7b17"
  },
  {
    "company": "Confidential",
    "education": "UG: Any Graduate - Any Specialization",
    "experience": "0 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this This person will play a key role in developing products and tools for United Layer operations. The ideal candidate must have skills and experience to develop applications using the desired skill set. Combined with managing expectations, the candidate should be able to work on multiple projects at the same time and ensure projects are completed on time. Overall it required 4-6 years of hands on experience in the areas of Python, Postgres, Javascript, jquery, Google Angular and using Django as the web framework. Responsibilities include: Independently develop logic, write code, test, debug, document and install software in accordance with industry best practices and specific internal procedures and standards Skilled in breaking down features into requirements, giving time estimates, and writing test procedures Be self-motivated, independent, proactive and an effective team player Implement complex applications working within a team Pay attention to detail to ensure all tasks and the applications have no loose ends Stay engaged with all projects and management on a weekly basis Provide accurate updates to management of the development status Drive understanding with audiences of varying technical ability through superb communication skills, both written and verbal Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Team Lead/Technical Lead Keyskills Lead Python Developer Python Postgres Javascript jquery Google Angular Django Desired Candidate Profile Qualifications include:Excellent verbal and written communication skillsBroad-based knowledge of Python, Postgres, Javascript, jquery, Google Angular and using Django as the web frameworkWillingness to learn in a fast paced environmentAbility to work alone or as part of a teamDetail-oriented and ability to meet deadlinesAbility to use judgment to make good decisionsWorks well under pressureBachelor's degree preferred Education- UG: Any Graduate - Any Specialization Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": "050916900988",
    "joblocation_address": "Bengaluru",
    "jobtitle": "Lead Python Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-10 16:21:10 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "1890026e189d1349a13b5337861211b5"
  },
  {
    "company": "Grid Logic Software Private Limited",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Provide technical expertise through a hands- on approach developing enterprise services, internet based applications, and business support tools. Participate in the design, definition, planning, development, and implementation of and projects conforming to software development best practices. Function as a hands- on member of the Mobile Delivery team through design, documentation, development, deployment, and maintaining applications. Design and conduct proof of concepts, and final production code for innovative software solutions, leveraging Mobile technologies, and standard application frameworks. Ensure adherence to existing enterprise direction and architectural strategies. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Professional experience in a Python web environment Strong backend development and experience with Django Must have the ability to be a FULL STACK ENGINEER using CSS, HTML, Javascript Work in an AGILE environment Lead by example and be a good team player Good and clear communication Interest in being part of a fast- paced and exciting web environment Have an entrepreneurial mindset Ability to work with complex systems XML parsing and generation using python. Experience in using MySQLdb and psycopg. Experience in using python on Linux. Making daemon programs in Linux using python. Experience with logging module of python Company Profile: Grid Logic Software Private Limited Grid Logic Software Private Limited Download PPT Photo 1   View Contact Details",
    "jobid": 110316501597,
    "joblocation_address": "Hyderabad / Secunderabad",
    "jobtitle": "Python Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-11 02:30:20 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "657778b9aa4b62a1fb0cf4f603923742"
  },
  {
    "company": "Confidential",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate",
    "experience": "3 - 7 yrs",
    "industry": "Recruitment / Staffing",
    "jobdescription": "Job Description   Send me Jobs like this Job Title: UI- Designer & Developer Experience: 3 7 Yrs Location: Bangalore Job Description: Very Good in Dojo or any other Javascript libraries. Good in Ajax, Javascript, HTML concepts. Angular JS, JSON, Java script, Ajax, HTML CSS and any knowledge on python or Django sever would be added advantage. Jboss drools. Design Patterns. Good in oops and Data strcutures. XML parsers, Xpath, XSLT and JAXB. We are looking for someone who can join within 60 days. Salary: Not Disclosed by Recruiter Industry: Recruitment / Staffing Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills HTML CSS Javascript Ajax Python User Interface Designing JSON XML Django Dojo Java script Angular JS Desired Candidate Profile   Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": "080716900590",
    "joblocation_address": "Bengaluru",
    "jobtitle": "UI Designer/developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-10 16:21:21 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "8c8b9b473694a42adf80a6ba1e1c1267"
  },
  {
    "company": "Confidential",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate",
    "experience": "8 - 13 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Skills: Java, Python, Spring, Hadoop. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Team Lead/Technical Lead Keyskills Java Python Spring Hadoop Desired Candidate Profile   Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": 280116006749,
    "joblocation_address": "Bengaluru",
    "jobtitle": "Principal Data Engineer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-11-25 22:46:56 +0000",
    "site_name": "www.naukri.com",
    "skills": "IT Software - Application Programming",
    "uniq_id": "e3b3592a97a78010e436c398883451cd"
  },
  {
    "company": "Ajax Management Consultants (P) Ltd hiring for Hiring for Leading MNC Companies",
    "education": "UG: B.Com - Commerce, B.Sc - Any Specialization, B.B.A - Management, BCA - Computers PG:MBA/PGDM - Any Specialization, HR/Industrial Relations, PG Diploma - Any Specialization Doctorate:Doctorate Not Required",
    "experience": "0 - 2 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this * Sourcing, Recruitment, Induction,On boarding. * HR Policy along HR Attendance & Leave records. * PMS Workforce Management. * Employee motivation and conducting R & R. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:HR Executive Keyskills Hr Consulting HR and Administration and IR HR and Recruitment hr generalist hr executive human resource and recruitment recruiter staffing Payroll Processing mba hr bba msw Desired Candidate Profile Education- UG: B.Com - Commerce, B.Sc - Any Specialization, B.B.A - Management, BCA - Computers PG:MBA/PGDM - Any Specialization, HR/Industrial Relations, PG Diploma - Any Specialization Doctorate:Doctorate Not Required *Excellent Communication *Hard working and eager to learn *Innovative and Creative *Able to handle all the HR Activities * Who can join ASAP. Company Profile: Ajax Management Consultants (P) Ltd Hiring for Leading MNC Companies We are hiring for our Reputed client. Download PPT Photo 1   View Contact Details",
    "jobid": "011215005930",
    "joblocation_address": "Bengaluru/Bangalore , Chennai , Hyderabad / Secunderabad",
    "jobtitle": "HR Executive",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-12-01 01:33:02 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "55e1861bb465cf0276ec561de56e2a0e"
  },
  {
    "company": "Headhuntersinc Consultancy Private Limited",
    "education": "UG: Any Graduate - Any Specialization, Graduation Not Required PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "0 - 1 yrs",
    "industry": "Recruitment / Staffing",
    "jobdescription": "Job Description   Send me Jobs like this We are looking for Freshers with Excellent oral and written communication skills, who will be interested for HR - Recruitment. CTC upto: 20K (Take home) Job Location: Mylapore, Chennai Interested candidates shall apply for the job. Salary:INR 1,50,000 - 2,50,000 P.A Industry: Recruitment / Staffing Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:HR Executive Keyskills Writing Communication Skills Written Communication recruitment recruiter hr it recruiter Desired Candidate Profile Education- UG: Any Graduate - Any Specialization, Graduation Not Required PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Headhuntersinc Consultancy Private Limited Headhuntersinc Consultancy Private Limited was founded in the year 2010 with the vision of providing holistic recruitment solutions in a Conventional and Non-conventional way across Sectors & Verticals. Right now our focus is on the South Indian mark Download PPT Photo 1   View Contact Details",
    "jobid": 261115005884,
    "joblocation_address": "Chennai",
    "jobtitle": "Opening for HR - Recruitment (fresher with Excellent Communication)",
    "numberofpositions": "",
    "payrate": "1,50,000 - 2,50,000 P.A",
    "postdate": "2015-11-26 01:33:26 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "43462ba6ba6bf6b1b1fcf7ffba046143"
  },
  {
    "company": "Excel Enterprises",
    "education": "UG: B.Sc - Any Specialization, B.Com - Commerce PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "1 - 4 yrs",
    "industry": "Recruitment / Staffing",
    "jobdescription": "Job Description   Send me Jobs like this Hiring Recruiter for our Internal team, we are Hyderabad based HR consulting firm with clients in India and abroad We are catering Recruitment needs of MNCs and Large Indian Business groups for the last 15 years Looking for Recruiters with at least 2 years experience in Non IT and IT Recruitments Salary:INR 1,00,000 - 2,00,000 P.A Industry: Recruitment / Staffing Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:Recruitment Executive Desired Candidate Profile Education- UG: B.Sc - Any Specialization, B.Com - Commerce PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Excel Enterprises 15 year old HR Consulting company Download PPT Photo 1   View Contact Details",
    "jobid": 120316601255,
    "joblocation_address": "Hyderabad / Secunderabad",
    "jobtitle": "Recruiter",
    "numberofpositions": "",
    "payrate": "1,00,000 - 2,00,000 P.A",
    "postdate": "2016-03-11 02:30:19 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "04e0ebc663c1ac168bf2f2c4dbb904c9"
  },
  {
    "company": "Global Consultant",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Doctorate Not Required",
    "experience": "10 - 12 yrs",
    "industry": "Recruitment / Staffing",
    "jobdescription": "Job Description   Send me Jobs like this The person will be responsible for helping us in getting empanelled with some of the new clients sometime by using his/her links in the industry area. so that we can provide manpower services in those companies.We will be paying him handsomely for this support Salary: Not Disclosed by Recruiter Industry: Recruitment / Staffing Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:HR Manager Keyskills HR Human Resource Management HR Manager recruitment Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Doctorate Not Required He must be working as HR manager in a some reputed company with good knowledge of recruitment process .He/she must have good links with HR managers of the companies Company Profile: Global Consultant Global Consultant Download PPT Photo 1   View Contact Details",
    "jobid": 280316900794,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "HR Manager",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-30 17:04:16 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "47515b3092dc82e7dda27a07690ea9a9"
  },
  {
    "company": "Axis Jobs",
    "education": "UG: Any Graduate - Any Specialization, Graduation Not Required PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "0 - 3 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Design and implement overall recruiting strategy. Develop and update job descriptions and job specifications. Perform job and task analysis to document job requirements and objectives. Prepare and post jobs to appropriate job board/colleges etc. Salary:INR 2,75,000 - 4,75,000 P.A. Best In The Industry Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:HR Executive Keyskills Recruitment Payroll Selection Joining Formalities Selection Process Hiring HR Assistance Staffing Screening Employee Relations Interviewing Resourcing Talent Acquisition hr human resource ir Fresher graduate undergraduate mba Desired Candidate Profile Education- UG: Any Graduate - Any Specialization, Graduation Not Required PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Good Verbal communication or Written communication . Team worker or Self-motivation Power. Energetic & self-motivated & team player. Good Computer Basic knowledge. Company Profile: Axis Jobs Axis Jobs Private Limited is a major technology, engineering, construction, manufacturing and financial services conglomerate, with global operations Service Provider in India. Download PPT Photo 1   View Contact Details",
    "jobid": 300316003517,
    "joblocation_address": "Bengaluru/Bangalore , Mumbai , Chennai , Pune , Hyderabad / Secunderabad , Delhi/NCR(National Capital Region) , Ahmedabad , Kolkata , Surat",
    "jobtitle": "HR Executive / Recruitment Executive",
    "numberofpositions": 6,
    "payrate": "2,75,000 - 4,75,000 P.A. Best In The Industry",
    "postdate": "2016-03-30 17:04:29 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "97b642a6f9fe418c31ea2244bdd066fd"
  },
  {
    "company": "executive-teams.com",
    "education": "",
    "experience": "0 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Coordinating interviews and constant follow-ups for the feedback. Maintaining Daily and weekly reports, maintaining the reports of Offered Candidate and Joines. Job postings on different job portals, Job boards and other social networking platform Salary:INR 3,00,000 - 6,00,000 P.A Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:Recruitment Executive Keyskills Interview Coordination Social Networking HR and Recruitment and IR hr generalist and ir Recruitment and Staffing administration admin executive Desired Candidate Profile HR Executive Job Company Profile: executive-teams.com We are Placement Consultant Providing Recruitment & Manpower Assistance to Global Clients Download PPT Photo 1   View Contact Details",
    "jobid": "050916004080",
    "joblocation_address": "Bengaluru, Chennai, Hyderabad",
    "jobtitle": "HR Executive Job",
    "numberofpositions": "",
    "payrate": "3,00,000 - 6,00,000 P.A",
    "postdate": "2016-10-10 16:21:12 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "1d548c26377cb34d70acefd06987edc7"
  },
  {
    "company": "Career Dimensions hiring for A Multinational Consulting Firm",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 5 yrs",
    "industry": "Strategy / Management Consulting Firms",
    "jobdescription": "Job Description   Send me Jobs like this Advise companies on best human capital management practices. Helps clients strategically integrate effective HR processes, programs and practices into their daily operations Perform internal reviews and audit of current systems and policies. Salary:INR 6,00,000 - 7,00,000 P.A Industry: Strategy / Management Consulting Firms Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:HR Business Partner Keyskills HR Consulting HR Processes Human Capital Management Hr OD Competency Mapping Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required We are looking out for people from pure HR Consulting profiles, people who are into designing HR systems, Policy formulation, competency mapping, JD Designing, Industry mapping, benchmarking, etc. Company Profile: Career Dimensions A Multinational Consulting Firm Our client is a multinational consulting firm, which provides consulting services to its clients in Accounting, Hr Consulting, Legal and taxation services. Download PPT Photo 1   View Contact Details",
    "jobid": "050516002025",
    "joblocation_address": "Delhi/NCR(National Capital Region)",
    "jobtitle": "Sr HR Consultant",
    "numberofpositions": 1,
    "payrate": "6,00,000 - 7,00,000 P.A",
    "postdate": "2016-05-05 11:34:58 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "bb4e562889f383eafa502ef0e7f2d558"
  },
  {
    "company": "TalentPro India HR Private Ltd.",
    "education": "UG: Any Graduate - Any Specialization, Graduation Not Required PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "5 - 8 yrs",
    "industry": "Textiles / Garments / Accessories",
    "jobdescription": "Job Description   Send me Jobs like this Good Communication Indusrty: From textile and manufacturing Experience: 6-7 years Immediate joinee preferred. Location-Vandavasi & Chennai No. of positions: 2 Salary:INR 3,50,000 - 4,50,000 P.A Industry: Textiles / Garments / Accessories Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:HR Manager Keyskills HR and Recruitment hr executive recruiter hr generalist recruitment hr manager Desired Candidate Profile Education- UG: Any Graduate - Any Specialization, Graduation Not Required PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: TalentPro India HR Private Ltd. www.talentproindia.com Download PPT Photo 1   View Contact Details",
    "jobid": 281115003281,
    "joblocation_address": "Chennai",
    "jobtitle": "Looking for Corporate Hr-vandavasi and Chennai",
    "numberofpositions": 2,
    "payrate": "3,50,000 - 4,50,000 P.A",
    "postdate": "2015-11-28 01:33:30 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "8878ef2d31f682a85db1de6dbf59a50f"
  },
  {
    "company": "2coms consulting pvt ltd",
    "education": "UG: Any Graduate PG:MBA/PGDM Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "10 - 11 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Manage HR service delivery and ensure alignment with business and HR strategic objectives. Act as primary connection between HR and local employees across all DTEs and serve as a local liaison to HR functions and service organizations. May include: design/ implementation of local employee engagement and recognition programs, providing mobility services, planning/ delivering training, coaching, mentoring and supervision. Manages service delivery of People Advisors. Key Skills: Your role includes some or all of the following key responsibilities. You should review these in conjunction with career level guidelines to gain a clear understanding of the expectations for your role. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:HR Manager Desired Candidate Profile Education- UG: Any Graduate PG:MBA/PGDM Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: 2coms consulting pvt ltd 2coms consulting pvt ltd Download PPT Photo 1   View Contact Details",
    "jobid": 140316500519,
    "joblocation_address": "Hyderabad / Secunderabad",
    "jobtitle": "HR Operation",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-14 02:30:20 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "a00cd5956b113d1e4667fcdc8da0f855"
  },
  {
    "company": "N.G Technologies Pvt Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "0 - 4 yrs",
    "industry": "Recruitment / Staffing",
    "jobdescription": "Job Description   Send me Jobs like this The job profile would cover the entire gamut of HR acitivities. The person selected for this position will have to perform the following activities: 1) Legal Compliance 2) HR Generalist areas 3) End-to-end Recruitment activities 4) Trng & Dev. Salary:INR 2,00,000 - 4,00,000 P.A Industry: Recruitment / Staffing Functional Area: HR , Recruitment , Administration , IR Role Category:HR/ Recruitment / IR Role:HR Executive Keyskills HR Generalist Activities Recruitment Payroll hr human Hr Generalist hr executive hr recruiter hr consultant Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: N.G Technologies Pvt Ltd. N.G technologies pvt ltd. is a best recruiting origination in India. And our aim is to make future and to give best placements for fresher and experience candidates.Aswell We are work with many Best Companies across India Download PPT Photo 1   View Contact Details",
    "jobid": 281015000545,
    "joblocation_address": "Hyderabad / Secunderabad , Bengaluru/Bangalore , Chennai",
    "jobtitle": "Recruitment Executive",
    "numberofpositions": "",
    "payrate": "2,00,000 - 4,00,000 P.A",
    "postdate": "2015-12-01 01:33:03 +0000",
    "site_name": "",
    "skills": "HR",
    "uniq_id": "303e18d8baa08e9b21b9c62b7b0dd2fd"
  },
  {
    "company": "Global One Corporate Services",
    "education": "UG: B.Sc - Any Specialization, B.A - Any Specialization, B.Tech/B.E. - Any Specialization, B.Com - Commerce, B.B.A - Management PG:M.Sc - Statistics Doctorate:Doctorate Not Required",
    "experience": "1 - 2 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this The position involves understanding the domain & process for generating energy data, monitoring processes & identifying failure reasons, issue ticket mgmt,verifying data quality & spotting data gaps, & data correction. Salary:INR 1,00,000 - 2,00,000 P.A. Plz apply by giving CTC details Industry: IT-Software / Software Services Functional Area: Executive Assistant , Front Office , Data Entry Role:Stenographer/Data Entry Operator Keyskills Financial Accounting Finance Data Analytics Data Analysis Excel Typing Speed Issue ticket mgmt verifying data quality spotting data gaps data correction Desired Candidate Profile Education- UG: B.Sc - Any Specialization, B.A - Any Specialization, B.Tech/B.E. - Any Specialization, B.Com - Commerce, B.B.A - Management PG:M.Sc - Statistics Doctorate:Doctorate Not Required The candidates must have strong MS Excel knowledge and superior typing speed. Database knowledge is a plus. Prior experience in financial accounting /billing /data analytics preferred.(0-3months) For interview send cv to resumes@globalone.in Company Profile: Global One Corporate Services U.S Based IT Company Download PPT Photo 1   View Contact Details",
    "jobid": 251115000250,
    "joblocation_address": "Chennai",
    "jobtitle": "Data Analyst",
    "numberofpositions": 3,
    "payrate": "1,00,000 - 2,00,000 P.A. Plz apply by giving CTC details",
    "postdate": "2015-11-25 01:33:39 +0000",
    "site_name": "",
    "skills": "Executive Assistant",
    "uniq_id": "b740db790c6c9659b66b244f0683f26d"
  },
  {
    "company": "Quest Venture Coordinators Pvt. Ltd",
    "education": "UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "0 - 2 yrs",
    "industry": "BPO / Call Centre / ITES",
    "jobdescription": "Job Description   Send me Jobs like this Data processing and entry from US directories Working in coordination with the whole team to give error free output Ensuring the quality as per the given standards Managing workflow to ensure timely deliverieshellip Skills Required > Graduate / Under Graduate - Any specialization > Typing speed of 40-45 WPM with at least 97% accuracy > Excellent written English communication skills > Proficient in MS-Office. Salary: Not Disclosed by Recruiter Industry: BPO / Call Centre / ITES Functional Area: ITES , BPO , KPO , LPO , Customer Service , Operations Role Category:Back Office/Web/Transaction Processing Role:Associate/Senior Associate -(NonTechnical) Keyskills coordination data entry ms office english data processing workflow standards communication skills typing speed working Desired Candidate Profile Education- UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Quest Venture Coordinators Pvt. Ltd Quest has been representing foreign companies in India since 1996. We fulfill various requirements of clients by providing project consultancy services and IT-enabled solutions. Our clients have entrusted us with several projects based on our professional and timely handling of business. CONSULTING Quest believes that the success of any venture depends on much more than just having a feasible project plan. The secret is in having management expertise in personnel, technology, financials, legal, marketing and advertising. Download PPT Photo 1   View Contact Details",
    "jobid": 170715502754,
    "joblocation_address": "Noida",
    "jobtitle": "DATA ENTRY",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-22 22:18:44 +0000",
    "site_name": "",
    "skills": "ITES",
    "uniq_id": "a943f4156883762deda92db042e24ea6"
  },
  {
    "company": "quest venture coordinators pvt. ltd.",
    "education": "UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 7 yrs",
    "industry": "BPO / Call Centre / ITES",
    "jobdescription": "Job Description   Send me Jobs like this Data processing and entry from US directories Working in coordination with the whole team to give error free output Ensuring the quality as per the given standards Managing workflow to ensure timely deliverieshellip Skills Required > Graduate / Under Graduate - Any specialization > Typing speed of 40- 45 WPM with at least 97% accuracy > Excellent written English communication skills > Proficient in MS- Office Salary: Not Disclosed by Recruiter Industry: BPO / Call Centre / ITES Functional Area: ITES , BPO , KPO , LPO , Customer Service , Operations Role Category:Back Office/Web/Transaction Processing Role:Associate/Senior Associate -(NonTechnical) Keyskills data entry english data processing ms office coordination workflow standards communication skills typing speed graduate Desired Candidate Profile Education- UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: quest venture coordinators pvt. ltd. quest venture coordinators pvt. ltd. Download PPT Photo 1   View Contact Details",
    "jobid": 110915500992,
    "joblocation_address": "Delhi , Delhi/NCR",
    "jobtitle": "DATA ENTRY",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-23 22:17:49 +0000",
    "site_name": "",
    "skills": "ITES",
    "uniq_id": "4b60647aad6e001523d3be8cc27c541b"
  },
  {
    "company": "quest venture coordinators pvt. ltd.",
    "education": "UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "0 - 2 yrs",
    "industry": "Recruitment / Staffing",
    "jobdescription": "Job Description   Send me Jobs like this Data processing and entry from US directories Working in coordination with the whole team to give error free output Ensuring the quality as per the given standards Managing workflow to ensure timely deliverieshellip Skills Required > Typing speed of 40-45 WPM with at least 97% accuracy > Excellent written English communication skills > Proficient in MS-Office. Salary: Not Disclosed by Recruiter Industry: Recruitment / Staffing Functional Area: ITES , BPO , KPO , LPO , Customer Service , Operations Role Category:Back Office/Web/Transaction Processing Role:Associate/Senior Associate -(NonTechnical) Keyskills coordination data entry ms office english data processing workflow standards typing speed communication communication skills Desired Candidate Profile Education- UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: quest venture coordinators pvt. ltd. Quest has been representing foreign companies in India since 1996. We fulfill various requirements of clients by providing project consultancy services and IT-enabled solutions. Our clients have entrusted us with several projects based on our professional and timely handling of business. Download PPT Photo 1   View Contact Details",
    "jobid": 170815500692,
    "joblocation_address": "Noida",
    "jobtitle": "DATA ENTRY",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-22 22:18:16 +0000",
    "site_name": "",
    "skills": "ITES",
    "uniq_id": "3017c406a252717794a3ecf77ee6bea7"
  },
  {
    "company": "Golden Opportunities Pvt Ltd",
    "education": "UG: Any Graduate - Any Specialization, Graduation Not Required PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 7 yrs",
    "industry": "BPO / Call Centre / ITES",
    "jobdescription": "Job Description   Send me Jobs like this Looking for professionals with 4+ years of experience in Data Governance Should have good experience in data governance, data quality, data analysis, data management, data quality,etc. Should have good experience in implementing data policies, standards and processes. Should have good experience in handling risk and finance data (.(credit risk, market risk, liquidity risk, basel, regulatory risk, etc.) Candidates from Banking background preferred The job holder will be act as data governance lead supporting the data management and improvement the data quality and support the compliance for various data requirements Salary: Not Disclosed by Recruiter Industry: BPO / Call Centre / ITES Functional Area: Analytics & Business Intelligence Role Category:Analytics & BI Role:Data Analyst Keyskills Data Quality data governance Data Management data policies data analytics Data Processing Data Modeling Data Cleansing data extraction data profiling data segmentation data mining data policy Desired Candidate Profile Education- UG: Any Graduate - Any Specialization, Graduation Not Required PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Golden Opportunities Pvt Ltd Golden Opportunities Pvt Ltd Download PPT Photo 1   View Contact Details",
    "jobid": "020616000487",
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Assistant Manager - Data Governance",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-08-06 18:43:55 +0000",
    "site_name": "",
    "skills": "Analytics & Business Intelligence",
    "uniq_id": "0fb14febfc70305d80f0847afd96da20"
  },
  {
    "company": "GE India Technology Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. - Any Specialization, Computers, B.Sc - Any Specialization, Computers PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "7 - 12 yrs",
    "industry": "Pharma / Biotech / Clinical Research",
    "jobdescription": "Job Description   Send me Jobs like this Assist with delivery of data warehouse and business intelligence solutions to meet short and long term EDM objectives. Leverage experience in data design, data modelling, data integration and ETL to achieve these objectives. Oversee and assist in the development process, including planning and monitoring of development efforts, managing development progress and deliverables. Develop a deep understanding of the data and flows from source systems utilized. Work with Sr. Architects and EDM Analytics Leaders to understand business needs and information requirements. Assist with definition of optimum system requirements to meet business needs, and prioritize and manage new requirements across multiple subject areas. Perform business analysis including analysis of the data flows and the system data. Perform extensive source system data mapping to gain a strong understanding of the data needed for metrics and available for reporting. Develop and assist with the development of robust wing to wing data designs, including logical and physical data models, that cover source system ingestion to performance tuned downstream data delivery. Ensure that these designs fit within the overall data strategy. Design ETL build specifications and testing specifications that ensure technical compatibility and integration with existing solutions. Ensure that each design incorporates security, change management, data quality validations, data lineage and metadata capture. Assist with ETL build and ensure that all development ties to existing standards. Assist with system testing design and oversee the rollout of new data ingestion, analytics and data structures. Salary: Not Disclosed by Recruiter Industry: Pharma / Biotech / Clinical Research Functional Area: IT Software - DBA , Datawarehousing Role Category:Programming & Design Role:Database Architect/Designer Keyskills Data Warehousing Data Modeling Data Integration Business Intelligence ETL Data Quality Business Analysis Analytics Change Management System Testing Oracle Informatica Business Objects Oracle Business Intelligence Tableau Desired Candidate Profile Education- UG: B.Tech/B.E. - Any Specialization, Computers, B.Sc - Any Specialization, Computers PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required BS Degree in Information Systems, Computer Science or related technical discipline or equivalent Minimum four years of experience in a data management, architecture, or data centric technical role Minimum seven years IT experience.Experience with multiple database technologies a plus Good interpersonal and leadership skills a plus DBA experience a plus; Experience with Oracle, Informatica, Business Objects, Oracle Business Intelligence, Tableau, Spotfire; Multidimensional/Relational (MOLAP/ROLAP) experience; Data Warehouse architecture and modeling experience; Ability to identify potential problems, determine and implement solutions; Proficient at new product evaluation, architecture, implementation, and integration with data Warehouse and business Intelligence application; Experience with data modelling methodologies and tools Experience with two or more database technologies (Oracle, Teradata, Sybase, SQL Server, etc.) Good knowledge and hands-on experience with Informatica Power Center, ETL architecture, data flow diagramming, data mapping documents, developing ETL, trouble shooting and performance tuning. Ability to profile data by using advanced SQL skills to understand the functional aspects of the data Good understanding of data warehousing technologies and structure options Experience with multiple reporting tools Strong leadership, organization, problem solving, communication and facilitation skills; High level of energy and enthusiasm, with ability to thrive in a rapidly changing environment; Strong project management skills; Excellent communication skills both written and verbal ability to communicate clearly and concisely across all levels of the organization; Self-motivated with ability to work effectively and cooperatively with both project and infrastructure teams and to work both independently and as part of a larger team; Ability to stay current with technology through training and/or job experience. Company Profile: GE India Technology Pvt. Ltd. Engineering Analysis Center of Excellence (EACoE) is the Engineering & technology hub for GE Infrastructure located at the John F Welch Technology Centre, Bangalore. The team is part of the Global Engineering team of the Infrastructure businesses like Aviation, Energy, Oil & Gas and Water technologies, engaged in high-end design and analysis of Aircraft Engine components, Steam / Gas / Wind Turbines and Generators and mechanical drives for oil & gas applications. Download PPT Photo 1   View Contact Details",
    "jobid": 120216900493,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Lead Data Architect",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-02-13 07:23:37 +0000",
    "site_name": "",
    "skills": "IT Software - DBA",
    "uniq_id": "58193e5513f7a637ef19f558e2054fe7"
  },
  {
    "company": "GE India Technology Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. - Computers PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Doctorate Not Required",
    "experience": "10 - 12 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Role Summary/Purpose: Assist with delivery of data warehouse and business intelligence solutions to meet short and long term EDM objectives. Leverage experience in data design, data modelling, data integration and ETL to achieve these objectives. Oversee and assist in the development process, including planning and monitoring of development efforts, managing development progress and deliverables. Develop a deep understanding of the data and flows from source systems utilized. Essential Responsibilities : Work with EDM Analytics Leaders to understand business needs and information requirements. Assist with definition of optimum system requirements to meet business needs, and prioritize and manage new requirements across multiple subject areas. Perform business analysis including analysis of the data flows and the system data. Perform extensive source system data mapping to gain a strong understanding of the data needed for metrics and available for reporting. Develop and assist with the development of robust wing to wing data designs, including logical and physical data models, that cover source system ingestion to performance tuned downstream data delivery. Ensure that these designs fit within the overall data strategy. Design ETL build specifications and testing specifications that ensure technical compatibility and integration with existing solutions. Ensure that each design incorporates security, change management, data quality validations, data lineage and metadata capture. Assist with ETL build and ensure that all development ties to existing standards. Assist with system testing design and oversee the rollout of new data ingestion, analytics and data structures. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - DBA , Datawarehousing Role Category:Programming & Design Role:Database Architect/Designer Keyskills Oracle Informatica Business Objects Oracle Business Intelligence Tableau Spotfire data management architecture Data Warehouse architecture data modeling SQL ETL Informatica Power Center ETL architecture Desired Candidate Profile Education- UG: B.Tech/B.E. - Computers PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Doctorate Not Required Qualifications/Requirements: BS Degree in Information Systems, Computer Science or related technical discipline or equivalent Minimum seven years of experience in a data management, architecture, or data centric technical role Minimum Ten years IT experienceDesired Characteristics : Proven track record of implementing large scale data warehouse as a Data Architect. Experience in implementing data security with adherence to multiple compliance requirements. Experience with multiple data management technologies a plus Good interpersonal and leadership skills a plus DBA experience a plus; Experience with Oracle, Informatica, Business Objects, Oracle Business Intelligence, Tableau, Spotfire; Multidimensional/Relational (MOLAP/ROLAP) experience; Data Warehouse architecture and data modeling experience; Ability to identify potential problems, determine and implement solutions; Proficient at new product evaluation, architecture, implementation, and integration with data Warehouse and business Intelligence application; Experience with two or more database technologies (Oracle, Teradata, Sybase, SQL Server, etc.) Good knowledge and hands-on experience with Informatica Power Center, ETL architecture, data flow diagramming, data mapping documents, developing ETL, trouble shooting and performance tuning. Ability to profile data by using advanced SQL skills to understand the functional aspects of the data Strong understanding of data warehousing technologies and structure options Experience with multiple reporting tools Strong leadership, organization, problem solving, communication and facilitation skills; High level of energy and enthusiasm, with ability to thrive in a rapidly changing environment; Strong end to end program management execution Excellent communication skills - both written and verbal - ability to communicate clearly and concisely across all levels of the organization; Self-motivated with ability to work effectively and cooperatively with both project and infrastructure teams and to work both independently and as part of a larger team; Ability to stay current with technology through training and/or job experience . Company Profile: GE India Technology Pvt. Ltd. Engineering Analysis Center of Excellence (EACoE) is the Engineering & technology hub for GE Infrastructure located at the John F Welch Technology Centre, Bangalore. The team is part of the Global Engineering team of the Infrastructure businesses like Aviation, Energy, Oil & Gas and Water technologies, engaged in high-end design and analysis of Aircraft Engine components, Steam / Gas / Wind Turbines and Generators and mechanical drives for oil & gas applications. Download PPT Photo 1   View Contact Details",
    "jobid": 300316900502,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Senior Data Architect",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-30 17:03:55 +0000",
    "site_name": "",
    "skills": "IT Software - DBA",
    "uniq_id": "ad470e84435d1371a12e3f66afbd91af"
  },
  {
    "company": "BVR People Consulting hiring for Hiring for a Leading Power & Automation Company- Bangalore",
    "education": "UG: B.Tech/B.E. - Any Specialization PG:M.Sc - Computers, MCA - Computers Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "4 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Greetings !!! Hiring for Data Engineer for a leading Power and Automation Company - Bangalore Designation : Data Engineer Location : Bangalore Qualification : BE/MSC(Computers)/MCA Experience : 4-7 years Main responsibilities Design of DataMart for various functions like Pricing, Products, Sales, Marketing, Quality etc. Develop an understanding on the format of the Data (Metadata) from various business Processes. Develop standardization of Data format across business function in conjunction with various functions Document data flows and mappings between source and target systems, Metadata, Business rules and update the documents periodically in collaboration tools like SharePoint Bulk upload of daily data with full refresh or incremental refresh Jointly explore with Data analyst on possibility of automation of data reporting using the database Will support the data analyst in fixing the data quality issue by doing the necessary modification in the data file or at database level. Define rules together with the business for automated data cleaning and data correction Coordination with local SAP development team for data export/imports Additionally to develop functional knowledge of data flow and business logic governing the data Will execute functions like monitoring systems for availability and performance, backup and recovery, redundancy Write SQL code for creations of various database objects like Views, Store Procedures etc. Act from specification to implementation Interested candidates can share your resume to kokila@bvrpc.com Regards, Kokila Salary:INR 5,00,000 - 9,50,000 P.A Industry: IT-Software / Software Services Functional Area: IT Software - DBA , Datawarehousing Role Category:System Design/Implementation/ERP/CRM Role:Datawarehousing Technician Keyskills Data Quality Data Analysis Datawarehousing Desired Candidate Profile Education- UG: B.Tech/B.E. - Any Specialization PG:M.Sc - Computers, MCA - Computers Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Requirement Qualification: Fulltime BE/B.Tech (Any discipline if relevant exp.) or MSC (With Relevant exp.) Experience: Min 4 years of experience in managing Data Mart/Data ware house Experience in Data base administration like user management, Data backup and recovery Knowledge of data warehousing techniques, database design and implementation Experienced Database Administrator for Oracle/MySQL/SQL Server in a Solaris/Linux/Windows environment Knowledge of databases on virtual machines Working with various time zones (Asia, Europe and North America) with the global process owners across the world. Working knowledge of SAP (Material Master) will be an added benefit Knowledge of reporting tools like Microsoft PowerPivot and ODBC together with PowerPoint for creating reports will be an added benefit Company Profile: BVR People Consulting Hiring for a Leading Power & Automation Company- Bangalore Leading Engineering Consulting firm Download PPT Photo 1   View Contact Details",
    "jobid": 300316002264,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Hiring for Data Engineer for a Leading Power and Automation Company",
    "numberofpositions": 5,
    "payrate": "5,00,000 - 9,50,000 P.A",
    "postdate": "2016-03-30 17:03:37 +0000",
    "site_name": "",
    "skills": "IT Software - DBA",
    "uniq_id": "c5a5ea0beff50a6a9100a55e0fe36ade"
  },
  {
    "company": "GE India Technology Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Doctorate Not Required",
    "experience": "4 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Role Summary/Purpose Deep technical expert who is responsible for the overall design, documentation, maintenance and integration of the available technology environment/frameworks within the Finance IT Data Lake team. You will be responsible for architecting ERP data ingestion initiatives into the Data Lake platform for Finance IT. The candidate should have strong expertise in current Big Data Technologies like Hadoop, Greenplum, Talend, Spark, Kafka, Flume to drive optimal data processing within the Data Lake. Essential Responsibilities Provide technical leadership on High Level Architecture and Design, data modeling, Big Data strategy & adoption for Archiving and Analytics Applications within the Finance IT domain Develop and maintain an integrated data architecture spanning the relational and Big Data landscape, representing the multitude of GE Finance IT functional areas and key business processes Drive the development of data services and maintain the data architectural artifacts, such as the Conceptual Model, Logical Data Model, and Physical Data Models as applicable Ensure that all measures for data quality, data governance, security and compliance of data are adhered to Participate in peer reviews reviewing work products related to the Data Lake Services Work with Business Analysts, Development teams, Product Owners, and Business SME to identify requirements and consolidate enterprise data model consistent with business processes Prioritize and scale DWH Architecture efforts in close coordination with Software COE and other Finance IT stakeholders Have the ability to see the big picture with a demonstration of strong business acumen Able to communicate to both highly technical and non-technical stakeholders effectively Requirements Bachelor's Degree in Computer Science or Engineering Minimum of 8 years experience in enterprise environment with data management and / or analytics responsibilities Minimum 4 years of hands-on experience with Big Data technologies processing large volumes of structured and unstructured data in a fast paced environment Strong expertise with cutting edge data processing using Hadoop framework, experience with streaming analytics and in-memory processing technologies like Spark, Talend, Greenplum, Flume, Kafka. Desired Characteristics Strong understanding of Data Warehousing, Business Intelligence, Reporting, Data Integration (ETL, EAI), and Data Replication Experience with Cloud Computing Demonstrated ability to lead and work in a matrix organization structure Proven analytical and problem resolution skills, excellent communication skills Prior experience with Finance/ERP environments Strong balance between commitment to principles and flexibility / practicality in a delivery setting Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - DBA , Datawarehousing Role Category:Admin/Maintenance/Security/Datawarehousing Role:DBA Keyskills Data Modeling ETL Data Warehousing Business Intelligence Data Integration Data Architecture Data Quality Cloud Computing Data Management Technical Leadership Desired Candidate Profile Education- UG: B.Tech/B.E. - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Doctorate Not Required   Company Profile: GE India Technology Pvt. Ltd. Engineering Analysis Center of Excellence (EACoE) is the Engineering & technology hub for GE Infrastructure located at the John F Welch Technology Centre, Bangalore. The team is part of the Global Engineering team of the Infrastructure businesses like Aviation, Energy, Oil & Gas and Water technologies, engaged in high-end design and analysis of Aircraft Engine components, Steam / Gas / Wind Turbines and Generators and mechanical drives for oil & gas applications. Download PPT Photo 1   View Contact Details",
    "jobid": 290316901231,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Data Lake Architect",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-29 17:04:20 +0000",
    "site_name": "",
    "skills": "IT Software - DBA",
    "uniq_id": "8b32ccb8d7983c35fb722cc22b49ea20"
  },
  {
    "company": "Quest Venture Coordinators Pvt. Ltd",
    "education": "UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "1 - 2 yrs",
    "industry": "BPO / Call Centre / ITES",
    "jobdescription": "Job Description   Send me Jobs like this Conducting Web research to compile information on company details and executives Experience in internet based research via search engines and networking sites Ensuring the quality as per the given standards and managing workflow to ensure timely deliveries Skills Required > Graduate / Under Graduate - Any specialization > Fast learner, passionate about online research > Basic knowledge of MS Office is desirable > Excellent written English communication skills. Salary: Not Disclosed by Recruiter Industry: BPO / Call Centre / ITES Functional Area: ITES , BPO , KPO , LPO , Customer Service , Operations Role Category:Back Office/Web/Transaction Processing Role:Associate/Senior Associate -(NonTechnical) Keyskills networking english workflow online research standards passionate search engines fast learner web research knowledge of ms office Desired Candidate Profile Education- UG: Any Graduate PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Quest Venture Coordinators Pvt. Ltd Quest has been representing foreign companies in India since 1996. We fulfill various requirements of clients by providing project consultancy services and IT-enabled solutions. Our clients have entrusted us with several projects based on our professional and timely handling of business. CONSULTING Quest believes that the success of any venture depends on much more than just having a feasible project plan. The secret is in having management expertise in personnel, technology, financials, legal, marketing and advertising. Download PPT Photo 1   View Contact Details",
    "jobid": 170715502758,
    "joblocation_address": "Noida",
    "jobtitle": "WEB RESEARCH",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-22 22:18:14 +0000",
    "site_name": "",
    "skills": "ITES",
    "uniq_id": "ebcad81ad946f3f2a3eb8cddc41d4f23"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "",
    "experience": "5 - 10 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this We build apps used by millions of people, and we take great pride in our work. This means excellent development practices, careful code architecture, and an organization built around rapid releases. Salary:INR 6,00,000 - 12,00,000 P.A Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Other Role:IT/Technical Content Developer Keyskills android creative apps symbian producer apps creative applications Desired Candidate Profile Please refer to the Job description above Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": 200616004841,
    "joblocation_address": "Bengaluru, Mumbai, Indore",
    "jobtitle": "Android Developer",
    "numberofpositions": "",
    "payrate": "6,00,000 - 12,00,000 P.A",
    "postdate": "2016-10-11 16:20:58 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "5504127c50a0b82e6cefd65ac4daac7a"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization",
    "experience": "1 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this InstaCar is looking for the Operation Executive who are ready to put their idea into the real world. This role reports to the Manager of Operations Strategy by identifying and implementing opportunities that are just beyond the boundaries. Salary:INR 1,75,000 - 2,00,000 P.A Industry: IT-Software / Software Services Functional Area: Sales , Retail , Business Development Role Category:Sales Support Role:Sales Coordinator Keyskills sales crisis management strategic planning Business Development Corporate Sales Direct Marketing sale business development bde Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": 150716007002,
    "joblocation_address": "Pune, Bengaluru, Mumbai, Indore, Hyderabad",
    "jobtitle": "Operations Executive",
    "numberofpositions": 5,
    "payrate": "1,75,000 - 2,00,000 P.A",
    "postdate": "2016-12-20 18:19:24 +0000",
    "site_name": "www.naukri.com",
    "skills": "Sales",
    "uniq_id": "285224b196ab310b1aa73c22e0e72001"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization, BCA - Computers PG:Any Postgraduate, MS/M.Sc(Science) - Any Specialization, MBA/PGDM - Any Specialization",
    "experience": "1 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Administration Head is responsible for ensuring businesses run smoothly. Preside over facilities management, allocate office space, oversee mail department, materials scheduling, and other works of organisation. Salary:INR 1,75,000 - 4,75,000 P.A Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Senior Management Role:Head/VP/GM-Quality Keyskills Operations Analytical Skills target oriented negotiating formulation development skills claim changes skills Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization, BCA - Computers PG:Any Postgraduate, MS/M.Sc(Science) - Any Specialization, MBA/PGDM - Any Specialization Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": 190716008191,
    "joblocation_address": "Bengaluru, Mumbai, Indore",
    "jobtitle": "Administration Head",
    "numberofpositions": "",
    "payrate": "1,75,000 - 4,75,000 P.A",
    "postdate": "2016-10-11 16:21:09 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "c6d9733dc3ea40c19e68b0ceb7c83e24"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "PG:MBA/PGDM - Any Specialization",
    "experience": "1 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this We are looking for a Digital Marketing Manager to develop, implement, track and optimise our digital marketing campaigns across all digital channels. Salary:INR 1,75,000 - 4,75,000 P.A Industry: IT-Software / Software Services Functional Area: Sales , Retail , Business Development Role Category:Retail Sales Role:Sales Executive/Officer Keyskills internet marketing online marketing online reputation sem online reputation manage email list deliver emails manage sms list engagement emails Desired Candidate Profile Please refer to the Job description above Education- PG:MBA/PGDM - Any Specialization Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": 140716007694,
    "joblocation_address": "Bengaluru, Mumbai, Indore",
    "jobtitle": "Internet Marketing",
    "numberofpositions": "",
    "payrate": "1,75,000 - 4,75,000 P.A",
    "postdate": "2016-10-11 16:21:18 +0000",
    "site_name": "",
    "skills": "Sales",
    "uniq_id": "a6c0238f4aa152826c5005a6c0ac4852"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "",
    "experience": "5 - 10 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this We are looking for an IOS Developer who carry passion for pushing mobile technologies to the next level by joining our Awesome IOS Team. We are looking to hire IOS Developer who can design and build advanced applications for IOS programme. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills ios developer Application Designing creative designs programming designs Desired Candidate Profile Please refer to the Job description above Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": 200616004910,
    "joblocation_address": "Bengaluru, Mumbai, Indore",
    "jobtitle": "IOS Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-11 16:21:06 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "b628a95920160cbbdbab01a8570786f1"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate",
    "experience": "0 - 2 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Call Centre executive is responsible for answering calls politely and professionally to provide information about services,Processing or taking orders, filling in forms and applications. Salary:INR 50,000 - 1,25,000 P.A Industry: IT-Software / Software Services Functional Area: ITES , BPO , KPO , LPO , Customer Service , Operations Role Category:Voice Role:Associate/Senior Associate -(Technical) Keyskills Customer Relationship Relationship Management client servicing client servicing executive customer relation Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": "020416000836",
    "joblocation_address": "Indore, Bengaluru, Mumbai",
    "jobtitle": "Call Centre Executive",
    "numberofpositions": "",
    "payrate": "50,000 - 1,25,000 P.A",
    "postdate": "2016-10-11 16:21:06 +0000",
    "site_name": "",
    "skills": "ITES",
    "uniq_id": "4ec940d1c7ace68c5cc5296de1a8ebc5"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:MBA/PGDM - Any Specialization",
    "experience": "1 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Sales Executive / Manger require to accomplishes business development activities by researching and developing marketing opportunities and plans and who are willing to do touring for Business Enhancement. Salary:INR 1,75,000 - 2,50,000 P.A Industry: IT-Software / Software Services Functional Area: Sales , Retail , Business Development Role Category:Retail Sales Role:Sales Executive/Officer Keyskills Sales Executive Activities Marketing Business Development Business Enhancement Staff Management Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization PG:MBA/PGDM - Any Specialization Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": 200716005355,
    "joblocation_address": "Bengaluru, Mumbai, Indore",
    "jobtitle": "Sales Executive / Manager",
    "numberofpositions": "",
    "payrate": "1,75,000 - 2,50,000 P.A",
    "postdate": "2016-10-11 16:21:00 +0000",
    "site_name": "",
    "skills": "Sales",
    "uniq_id": "ec5ef8f1ce3b62c9b2b32794362668fd"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization, B.Tech/B.E. - Any Specialization, B.Sc - Any Specialization PG:MBA/PGDM - Any Specialization, MCA - Computers, MS/M.Sc(Science) - Any Specialization",
    "experience": "1 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this We are looking for a driven Social Media Manager to attract and interact with targeted virtual communities and networks users. The goal is to gradually achieve superior customer engagement and website traffic. Salary:INR 1,75,000 - 4,75,000 P.A Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Admin/Maintenance/Security/Datawarehousing Role:IT/Networking-Manager Keyskills Twitter Social Media Digital Media Media Management Management execution Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization, B.Tech/B.E. - Any Specialization, B.Sc - Any Specialization PG:MBA/PGDM - Any Specialization, MCA - Computers, MS/M.Sc(Science) - Any Specialization Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": 190716008451,
    "joblocation_address": "Bengaluru, Mumbai, Indore",
    "jobtitle": "Social Media Manager",
    "numberofpositions": "",
    "payrate": "1,75,000 - 4,75,000 P.A",
    "postdate": "2016-10-11 16:21:12 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "e6529bf1674bde68282cc3aa2b0eb90c"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "",
    "experience": "2 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Business process manager is responsible for evaluates, designs, executes, measures, monitors and controls business processes. Managers work to ensure that business process outcomes are in harmony with an organization's strategic goals Salary:INR 3,50,000 - 8,00,000 P.A Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:System Design/Implementation/ERP/CRM Role:Business Analyst Keyskills Business Process Management Business Process Analysis business analysis business process research business process reporting Desired Candidate Profile Please refer to the Job description above Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": 140716007925,
    "joblocation_address": "Mumbai, Indore, Bengaluru",
    "jobtitle": "Business Process Manager",
    "numberofpositions": "",
    "payrate": "3,50,000 - 8,00,000 P.A",
    "postdate": "2016-10-11 16:21:03 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "2a0f5787889ecc3a79c69c94c8efcdba"
  },
  {
    "company": "InstaCar Technologies Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate",
    "experience": "1 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Providing help and advice to customers using your organization's products or services, communicating courteously with customers by telephone, email, letter and face to face,handling customer complaints or any major incidents etc. Salary:INR 60,000 - 2,50,000 P.A Industry: IT-Software / Software Services Functional Area: ITES , BPO , KPO , LPO , Customer Service , Operations Role Category:Voice Role:Associate/Senior Associate -(Technical) Keyskills CRM Customer Relationship Relationship Management client servicing Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate Company Profile: InstaCar Technologies Pvt. Ltd. We are a fast-growing taxi rental marketplace with one dream: making each road trip happy. Attempting to fill the gap of getting outstation taxis across India. Download PPT Photo 1   View Contact Details",
    "jobid": "020416000949",
    "joblocation_address": "Bengaluru, Indore, Mumbai",
    "jobtitle": "Customer Relationship Manager",
    "numberofpositions": "",
    "payrate": "60,000 - 2,50,000 P.A",
    "postdate": "2016-10-11 16:21:09 +0000",
    "site_name": "",
    "skills": "ITES",
    "uniq_id": "fa24759e638d6b67adb022e4d7bfca75"
  },
  {
    "company": "GE India Technology Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. - Computers, Electrical, Electronics/Telecommunication PG:M.Tech - Computers, Electrical, Electronics/Telecommunication Doctorate:Doctorate Not Required",
    "experience": "3 - 5 yrs",
    "industry": "Pharma / Biotech / Clinical Research",
    "jobdescription": "Job Description   Send me Jobs like this In this role, you will be designing and developing innovative web and mobile based software solutions for Transportation business. You will be hands on design, development and maintenance of a component, feature and/or feature set. You will be collaborating with other product & partner teams to enable product delivery & leveraging best practices and processes. Essential Responsibilities Be responsible for designing and developing web and mobile applications in a fast paced and agile development environment using latest software development technologies and infrastructure. Work with product owners and architects to understand product requirements and vision Perform application support working closely with the customer support team, to diagnose and resolve customer reported issues and anomalies. Engage in technical discussions; participate in technical designs and present technical ideas through white boarding Maintain code quality through best practices, unit testing and code quality automation Work as an individual contributor and take guidance from software technical leader. Work in an environment of developers using open source development tools. Salary: Not Disclosed by Recruiter Industry: Pharma / Biotech / Clinical Research Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Javascript HTML5 CSS AngularJS BackboneJS EmberJS KnockoutJS Camel Drools JRules PostgreSQL Entity Framework ASP.NET MVC RESTful Web Services Desired Candidate Profile Education- UG: B.Tech/B.E. - Computers, Electrical, Electronics/Telecommunication PG:M.Tech - Computers, Electrical, Electronics/Telecommunication Doctorate:Doctorate Not Required Master's/Bachelor of Engineering in Electrical & Electronics or Electronics and Telecommunication or Computer Science or Instrumentation or equivalent with at least 3 to 5 years of relevant experience in ASP.NET, database tools and front end technologies.Experience working as part of teams following Agile Scrum methodologyExperience developing web applications. in ASP.NET, MVC, RESTful, Web ServicesExperience with front-end technologies such as Javascript, HTML5, CSS, AngularJS,BackboneJS, EmberJS, KnockoutJSExperience with database tools (PostgreSQL, Entity Framework, other ORMs such as LLBLGenPro, NoSQL concepts)Experience with rules engines (Camel, Drools, JRules)Experience with software version management (SVN, Git or Mercurial)Strong oral and written communication skills. Company Profile: GE India Technology Pvt. Ltd. Engineering Analysis Center of Excellence (EACoE) is the Engineering & technology hub for GE Infrastructure located at the John F Welch Technology Centre, Bangalore. The team is part of the Global Engineering team of the Infrastructure businesses like Aviation, Energy, Oil & Gas and Water technologies, engaged in high-end design and analysis of Aircraft Engine components, Steam / Gas / Wind Turbines and Generators and mechanical drives for oil & gas applications. Download PPT Photo 1   View Contact Details",
    "jobid": 300316900566,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Software Engineer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-30 17:04:00 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "5ef69d8d3a0532d708cb25d434a4a1ac"
  },
  {
    "company": "GE India Technology Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. - Computers, B.Sc - Computers, Maths, BCA - Computers PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required",
    "experience": "3 - 6 yrs",
    "industry": "Pharma / Biotech / Clinical Research",
    "jobdescription": "Job Description   Send me Jobs like this In this role, you will be designing and developing innovative web and mobile based software solutions for Transportation business. You will be hands on design, development and maintenance of a component, feature and/or feature set. You will be collaborating with other product & partner teams to enable product delivery & leveraging best practices and processes. Essential Responsibilities Act as a member of the Software Center of Excellence, representing the face of high quality design and development practices Develop high performing, scaling and innovative end-to-end web applications Collaborate with system engineers, frontend developers and software developers to implement solutions that are aligned with and extend shared platforms and solutions Apply principles of SDLC and methodologies like Lean/Agile/XP, CI, Software and Product Security, Scalability, Documentation Practices, refactoring and Testing Techniques Writes codes that meets standards and delivers desired functionality using the technology selected for the project Build features such as web services and Queries on existing tables Understand performance parameters and assess application performance Work on core data structures and algorithms and implement them using language of choice Salary: Not Disclosed by Recruiter Industry: Pharma / Biotech / Clinical Research Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills ASP.NET MVC RESTful Web Services Javascript HTML5 CSS AngularJS BackboneJS EmberJS KnockoutJS NoSQL Camel Drools JRules Desired Candidate Profile Education- UG: B.Tech/B.E. - Computers, B.Sc - Computers, Maths, BCA - Computers PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required Bachelors Degree in Computer Science or in STEM Majors (Science, Technology, Engineering and Math) A minimum of 3 years of professional experience (include technical skill)Be responsible for designing and developing web and mobile applications in a fast paced and agile development environment using latest software development technologies and infrastructure .Work with product owners and architects to understand product requirements and visionPerform application support working closely with the customer support team, to diagnose andresolve customer reported issues and anomalies,Maintain code quality through best practices, unit testing and code quality automationWork as an individual contributor and take guidance from software technical leader,Work in an environment of developers using open source development tools. Desired Characteristics Experience working as part of teams following Agile Scrum methodologyExperience developing web applications. in ASP.NET, MVC, RESTful, Web ServicesExperience with front-end technologies such as Javascript, HTML5, CSS, AngularJS,BackboneJS, EmberJS, KnockoutJSExperience with database tools (PostgreSQL, Entity Framework, other ORMs such as LLBLGenPro, NoSQL concepts)Experience with rules engines (Camel, Drools, JRules)Experience with software version management (SVN, Git or Mercurial)Strong oral and written communication skills. Company Profile: GE India Technology Pvt. Ltd. Engineering Analysis Center of Excellence (EACoE) is the Engineering & technology hub for GE Infrastructure located at the John F Welch Technology Centre, Bangalore. The team is part of the Global Engineering team of the Infrastructure businesses like Aviation, Energy, Oil & Gas and Water technologies, engaged in high-end design and analysis of Aircraft Engine components, Steam / Gas / Wind Turbines and Generators and mechanical drives for oil & gas applications. Download PPT Photo 1   View Contact Details",
    "jobid": 300316900567,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Software Engineer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-30 17:04:44 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "e7d8b7c29b65a56992dd1a2777eae8ba"
  },
  {
    "company": "Confidential",
    "education": "",
    "experience": "6 - 9 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Hi, Your CV has been initially shortlisted for a suitable position with CMM level 5 MNC company pertaining to the position Sr. Software Engineer  having an exposure in \"Core Java, multi threading and collections\"   Exp: 6 to 9 years   Work location : Bangalore, (Whitefield, ITPL) I f you are interested for this opportunity please share your updated CV in the reply mail (khushbooj@scaleneworks.org) mentioning these details:  Present CTC  Expected CTC  Notice Period   Regards, Khushboo Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills &quot ; Core Java&quot ; &quot ; Multithreading&quot ; &quot ; Collections&quot ; multi threading Desired Candidate Profile   Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": 160915007191,
    "joblocation_address": "Bengaluru",
    "jobtitle": "Sr. Software Engineer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-10 16:21:16 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "fe4a9fcd45236cafa7b2130b186385d8"
  },
  {
    "company": "Valsatech Corp",
    "education": "",
    "experience": "3 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this We are looking for a strong resource with minimum of 3+ Years experience in Dot Net Development who have at least 3 Yrs of Experience in MVC Framework. Client Name: Will be disclosed later if you are interested (Product Company) Employment Type: Full Time Experience: 3 to 8 Years Position: Dot Net Developer (Sr. Developer) Company Type: Product Based Company Relevant Experience: Minimum 3 Years Exp in Dot Net Development, and 3 Yrs in MVC Framework Development Work Location: Hyderabad Joining time: Preferred less notice period Education: Any Graduate/Post Graduate with strong technical experience Mandatory Skills: Strong Experience in MVC Good Communication skills. Key skills: ASP.Net MVC, WCF ,C# ,Entity Framework ,SQL Server,.NET Framework ,VB.NET ,JAVA Script, J Query, J SON, HTML 5, CSS, BOOTSTRAP, etc... Job Description - Must have Strong Experience with ASP.NET MVC, Entity Framework, Web API - Good to have experience with Angular.JS, KnockOut.js and Node.Js - Strong Experience of JavaScript, JQuery and JSON - Strong Experience with SQL Server. - Good to have experience of Winform and WCF - Strong communication skills, high attention to detail, aggressive troubleshooting, and strong decision-making skills. - Experience designing secure applications and should be aware of security implications from design to implementation phase of project. Candidate is expected to be an Individual contributor/Senior Developer having ability to communicate with clients on requirement clarification and converting requirement into the deliverable. Looking for immediate joiners. If you like to apply for this positions please forward your updated resume to careers@valsatechcorp.com NOTE: Short listed candidates only will receive calls.. Resumes with above details will get call immediately. Salary:INR 1,00,000 - 4,00,000 P.A Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills ASP.Net MVC WCF C# Entity Framework SQL Server .NET Framework MVC Desired Candidate Profile Please refer to the Job description above Company Profile: Valsatech Corp Company Overview: Valsatech is a service based IT and IT-Staffing Company Founded in 2008, whose core motive is to provide Staffing, Software Testing and QA assistance to various companies. We provide end to end Recruitments and QA support to our clients and take care of every possible scenario. Specialties: IT Staffing, Staffing Solutions, Software Testing Services, Automation testing solutions, Agile testing, Onsite/Offshore/Nearshore solutions Company Size: 51-200 employees (All locations) Company Locations: Maryland, (United States), Bangalore (India), Hyderabad, Warangal (India) Download PPT Photo 1   View Contact Details",
    "jobid": "021116006924",
    "joblocation_address": "Hyderabad",
    "jobtitle": "Dot Net (mvc) Developer (3+ Yrs) Required @ Hyderabad",
    "numberofpositions": "",
    "payrate": "1,00,000 - 4,00,000 P.A",
    "postdate": "2016-12-23 18:18:57 +0000",
    "site_name": "www.naukri.com",
    "skills": "IT Software - Application Programming",
    "uniq_id": "c1c756b9f4567bdcd54f7e36febcf06f"
  },
  {
    "company": "Confidential",
    "education": "",
    "experience": "2 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Dear Professionals, Job Description: Exp 2 to 4 years Location Bangalore Notice Period Less than 30 days Overall 2-4 years of relevant experience in cross-platform [hybrid] mobile development technologies (or front-end web development technologies) Mandatory: 1) HTML5, CSS, JavaScript 2) jQuery 3) Backbone.js [at least 1 year experience] 4) MVC and OOPS concepts Interested can forward your profile to fazil.k@enterpriseits.com (or) Reach me at 0422-4545 -602. Thank You, Regards, Mohamed Fazil (Recruitment Consultant) Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Backbone HTML Javascript Jquery MVC Desired Candidate Profile   Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": 111215001184,
    "joblocation_address": "Bengaluru",
    "jobtitle": "Excellent Opportunity for UI Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-07 16:21:24 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "7458f7072c34fe0f91a77faefd79c451"
  },
  {
    "company": "Confidential",
    "education": "UG: B.Tech/B.E. - Any Specialization PG:M.Tech - Any Specialization, MBA/PGDM - Any Specialization, MS/M.Sc(Science) - Any Specialization",
    "experience": "3 - 7 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Designation:Software Engineer. JD - I am looking for a person who have expertise over Core java         and Angular JS. Both skills must be in current project. Exp. 2.9 to 7 years  If you are interested please share your updated profile on khushbooj@scaleneworks.org  and  I shall get in touch with you at the earliest. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Core Java Javascript Software Engineering Angular JS Desired Candidate Profile   Education- UG: B.Tech/B.E. - Any Specialization PG:M.Tech - Any Specialization, MBA/PGDM - Any Specialization, MS/M.Sc(Science) - Any Specialization Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": "061115005970",
    "joblocation_address": "Bengaluru",
    "jobtitle": "Software Engineer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-10 16:21:01 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "273afa62c1bbc9f90a32a27f840ab58f"
  },
  {
    "company": "Xsilica Software Solutions Pvt. Ltd.",
    "education": "",
    "experience": "3 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this 3+ Years of experience in C# ASP.NET MVC 4/5, SQL SERVER - stored procedures, job Entity Framework, Jquery, Javascript Web development, Web security knowledge, good in documentation, Testing. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Entity Framework ASP.Net MVC Javascript JQuery SQL Server C# Xamarin Web Development .Net Stored Procedures Dotnet asp.net MVC model view controller Desired Candidate Profile Please refer to the Job description above Company Profile: Xsilica Software Solutions Pvt. Ltd. X S I L I C A specializes in the business of offshore and on site software development work for clients across the globe providing software development services in the field of Enterprise Business Solutions, Internet Technologies. Download PPT Photo 1   View Contact Details",
    "jobid": 221216002170,
    "joblocation_address": "Hyderabad",
    "jobtitle": "Dotnet Developer",
    "numberofpositions": 1,
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-12-22 18:18:44 +0000",
    "site_name": "www.naukri.com",
    "skills": "IT Software - Application Programming",
    "uniq_id": "613de5bcbec57586d4a3e41b23bd55e9"
  },
  {
    "company": "Confidential",
    "education": "UG: Any Graduate - Any Specialization",
    "experience": "2 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this 2 to 6 years experience developing applications software Experience developing web services using JEE/Java/Spring required Clear understanding of MVC design pattern. Use of SpringMVC preferred Experience with integration frameworks such as Apache Camel or Mule a plus Experience using node.js to build scalable web services a plus Experience with other open source frameworks a plus (PHP, Rails, Grails, Django or similar) Experience with Oracle, MySql, or PostgreSQL and use of Hibernate, ORMs and/or jdbc required Experience with NoSql databases such as MongoDB or CouchDB a plus Understanding of document description languages such as JSON and XML Ready to travel onsite SHIFT: 01:00 PM to 10:00 PM (Cab facility available). Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Java Spring Mvc Hibernate Grails MySQL MongoDB Postgresql JEE JDBC NoSQL Design & Development Desired Candidate Profile   Education- UG: Any Graduate - Any Specialization Company Profile: Confidential Confidential Download PPT Photo 1   View Contact Details",
    "jobid": "041215900891",
    "joblocation_address": "Bengaluru",
    "jobtitle": "Java Developer/ Sr. Java Developer -immediate Joinees Only",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-11-26 22:46:54 +0000",
    "site_name": "www.naukri.com",
    "skills": "IT Software - Application Programming",
    "uniq_id": "6aea782df02338b897a1fff880e4e1d8"
  },
  {
    "company": "Okda Solutions",
    "education": "UG: B.Tech/B.E. - Computers PG:M.Tech - Computers, MS/M.Sc(Science) - Computers Doctorate:Doctorate Not Required",
    "experience": "6 - 11 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Primary Responsibilities : - Participate in all phases of the development lifecycle from initial requirements gathering and design through to implementation and support. - Author technical design specification document, and drive the solution though the software development life-cycle. - Research and recommend options within the specification, budget, and schedule. - Implement solutions on the Microsoft .NET platform, within an existing application framework. - Be a key contributor with all research and development (R&D) tasks and expected to show keen interest in learning new applications and tools. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills .Net Developer C# HTML CSS ASP .NET ASP.NET MVC WCF ASP.NET Web API LINQ Entity Framework JQuery SQL SSIS Desired Candidate Profile Qualifications :- 5+ years- experience developing core classes on the .Net framework (C# and ASP.NET as well as CSS, HTML, Javascript, and MS-SQL Server)- Previous experience with Service Oriented Architecture (SOA) - SOAP and REST webservices- Strong experience with the following technologies: C#, .NET, ASP.NET MVC, WCF, ASP.NET Web API, LINQ, Entity Framework, Unity (DI), JQuery, SQL, SSIS, HTML and CSS.- Experience with Salesforce Force.com, IBM Cast Iron, Adobe Flex and QlikView is a plus.- Experience in the use of agile processes and test driven development a big plus.- 10+ years of application development and IT implementation experience- BS/MS in Computer Science, Computer Engineering or similar technical degreeOther Skills :- Excellent communication skills (verbal and written)- Effective in a team environment as well as working independently- Excellent problem solving skills- Able to work in a fast-paced milestone driven environment- Excellent People Skills - Demonstrated ability to work with both technical and non- technical individuals, both in gathering information and communicating direction and status Education- UG: B.Tech/B.E. - Computers PG:M.Tech - Computers, MS/M.Sc(Science) - Computers Doctorate:Doctorate Not Required Company Profile: Okda Solutions Leading client of Okda Solutions Download PPT Photo 1   View Contact Details",
    "jobid": 221216902323,
    "joblocation_address": "Hyderabad",
    "jobtitle": "Sr . Net Developer - C#/ ASP/ Html/ CSS",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-12-23 18:18:53 +0000",
    "site_name": "www.naukri.com",
    "skills": "IT Software - Application Programming",
    "uniq_id": "6b27fd59ae28103beb6422888fe517b9"
  },
  {
    "company": "OKDA Solutions",
    "education": "UG: Any Graduate - Any Specialization Doctorate:Doctorate Not Required",
    "experience": "2 - 6 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Develop ASP.net web applications - Perform unit testing on developed modules - Update progress to team lead - Learn new technologies as and when required - Need to travel to onsite (ABROAD) as and when required . Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Web Technologies Unit Testing Team Leading ASP.net MVC C# Entity Framework SQL Server Javascript AJAX Web API Bootstrap AngularJS Desired Candidate Profile Skill set:- 2 to 6 Yrs of Experience- Experience in writing web applications using ASP.net MVC 4.0/4.5, C#, Entity Framework, SQL Server 2008/12- Experience in Javascript, AJAX and JQuery- Experience on Web API is preferred- Knowledge on Bootstrap, AngularJS is added advantage- Sound knowledge of SQL Server 2008/12 relational database concepts, SQL simple/complex queries, writingstored procedures etc.- Good understanding on multitier architecture application development- Good Communication SkillsFirst 120 Days Have to work in Gandhinagar after words transfer to Hyderabad office. Education- UG: Any Graduate - Any Specialization Doctorate:Doctorate Not Required Company Profile: OKDA Solutions Leading client of OKDA Solutions Download PPT Photo 1   View Contact Details",
    "jobid": 221216902435,
    "joblocation_address": "Hyderabad",
    "jobtitle": "Asp.net Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-12-22 18:18:47 +0000",
    "site_name": "www.naukri.com",
    "skills": "IT Software - Application Programming",
    "uniq_id": "666bda093dc4c5899fa89ed71f18a0a1"
  },
  {
    "company": "GS Consultants",
    "education": "UG: B.Tech/B.E. - Computers, Electrical, Electronics/Telecommunication PG:M.Tech - Computers, Electrical, Electronics/Telecommunication Doctorate:Doctorate Not Required",
    "experience": "6 - 10 yrs",
    "industry": "Recruitment / Staffing",
    "jobdescription": "Job Description   Send me Jobs like this Job responsibilities : Design, develop cloud based applications using Windows azure. Design; Develop web applications, desktop applications using Microsoft technologies (.NET, C#, Windows Azure, WCF, WPF, SQL Server). Salary: Not Disclosed by Recruiter Industry: Recruitment / Staffing Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Team Lead/Technical Lead Keyskills WCF C# SQL Server WPF Azure .Net Microsoft Technologies Web Technologies Windows Azure software development Object Oriented Analysis & Design ESB ASP.NET Desired Candidate Profile Education- UG: B.Tech/B.E. - Computers, Electrical, Electronics/Telecommunication PG:M.Tech - Computers, Electrical, Electronics/Telecommunication Doctorate:Doctorate Not Required Education :-BE/ BTech degree in Electrical, Electronics, or Computer Science with 8 to 10 plus years of software engineering experience-MTech/ MS degree in Electrical, Electronics or Computer Science with 6 to 8 plus years of software engineering experience.Experience/Qualifications :Required Technical Skills/Education: Understanding of the software development life cycle and processes Strong with Object Oriented Analysis & Design (OOAD) Understanding of software methodologies unified modeling language (UML). Designing and developing Azure cloud services web and worker roles, websites, sql azure, .net interoperability Strong Experience in working with Microsoft Azure cloud Experience with C# and .NET Programming language WCF, WPF, ESB, SQL Server, ASP.NET, C# Experience with Microsoft web technology stack Experience with Soap and Rest Web Service development in C# Experience with XML Knowledge in network protocols such as TCP/IP, UDP/IP. Experience with static code analysis tools like Findbugs, Coverity. Basics of Cyber SecurityPreferred Technical Skills/Education: Experience with Building Automation and/or HVAC domain Mobile application development(iPhone, Android, Windows phone) Agile software methodologies and tools SW management toolsAdditional Comments :This individual be self-directed, highly motivated, and organized with strong analytical thinking and problem solving skills, and an ability to work on multiple projects and function in a team environment. Company Profile: GS Consultants GS Consultants Download PPT Photo 1   View Contact Details",
    "jobid": "080816900803",
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Cloud Engineer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-08-08 18:43:36 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "6d69c9d90d4d1e9dc0574f5f26374d35"
  },
  {
    "company": "Axisvation Technologies Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. PG:MCA Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "9 - 12 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Job Description: Must be well proficient in . Net, C#, Windows Azure, MS SQL. Knowledge on: Visual Studio 2010, Windows Azure Services, . Net framework 2. 0, 3. 5, 4. 0 and above, C# VB. Net, Microsoft SQL Azure, Azure Blob & Table storage. Must have good experience in using tools like Visual Studio 20102012, MS SQL, VSS, TFS, etc Should have experience deployment of Windows Azure Application Experience in complete Windows Azure application development life-cycle The Candidate must have 9 to 12 years total, 5 years relevant into Windows Azure Should have experience in SQL Server 20082012 Understand browser specific compatibility issues. Candidate with hands on experience W3C HTML & HTML5 Knowledge on other clouds like AWS, Google, etc. Knowledge on Office 365 Strong knowledge on Azure architecture and Design. Work with end users to document workflows and business processes. Experience analysing complex business processes and articulating improvements to achieve operational efficiencies Work with end users to gather, define and prioritize functional system requirements and acceptance criteria based on business needs. Develop use case-based models to capture functional system requirements and corresponding test cases. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Technical Architect Keyskills tools application development html operational google ms sql life cycle windows azure azure visual studio 2010 Desired Candidate Profile Education- UG: B.Tech/B.E. PG:MCA Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Axisvation Technologies Pvt. Ltd. Axisvation is a technology consulting, IT services and solutions company. Axisvation offers next-gen solutions and services on Collaboration, Mobility and Cloud Space. Axisvation is formed by industry experts and veterans from top IT companies 100 man years of past project experience with Fortune 500 globe companies State-of-the-art Innovation lab and customer experience center in Mumbai Core focus on Technical excellence and Innovation Industry and Domain focus on Manufacturing, Retail , Health-Care, Life Sciences & BFSI Download PPT Photo 1   View Contact Details",
    "jobid": 101015500336,
    "joblocation_address": "Mumbai , Navi Mumbai",
    "jobtitle": "Azure Architect",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-12-29 02:23:57 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "5e137a33270eab78540be11c420baea9"
  },
  {
    "company": "Axisvation Technologies Pvt. Ltd.",
    "education": "UG: B.Tech/B.E. PG:M.Tech",
    "experience": "9 - 12 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Must be well proficient in .Net, C#, Windows Azure, MS SQL. Knowledge on: Visual Studio 2010, Windows Azure Services, .Net framework 2.0, 3.5, 4.0 and above, C# / VB.Net, Microsoft SQL Azure, Azure Blob & Table storage. Must have good experience in using tools like Visual Studio 2010/2012, MS SQL, VSS, TFS, etc Should have experience deployment of Windows Azure Application Experience in complete Windows Azure application development life-cycle The Candidate must have 9 to 12 years total, 5 years relevant into Windows Azure Should have experience in SQL Server 2008/2012 Understand browser specific compatibility issues. Candidate with hands on experience W3C HTML & HTML5 Knowledge on other clouds like AWS, Google, etc. Knowledge on Office 365 Strong knowledge on Azure architecture and Design. Work with end users to document workflows and business processes. Experience analysing complex business processes and articulating improvements to achieve operational efficiencies Work with end users to gather, define and prioritize functional system requirements and acceptance criteria based on business needs. Develop use case-based models to capture functional system requirements and corresponding test cases. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Technical Architect Keyskills tools application development html operational google sql server ms sql life cycle windows azure visual studio Desired Candidate Profile Please refer to the Job description above Education- UG: B.Tech/B.E. PG:M.Tech Company Profile: Axisvation Technologies Pvt. Ltd. Axisvation is a technology consulting, IT services and solutions company. Axisvation offers next-gen solutions and services on Collaboration, Mobility and Cloud Space. Axisvation is formed by industry experts and veterans from top IT companies 100 man years of past project experience with Fortune 500 globe companies State-of-the-art Innovation lab and customer experience center in Mumbai Core focus on Technical excellence and Innovation Industry and Domain focus on Manufacturing, Retail , Health-Care, Life Sciences & BFSI. Download PPT Photo 1   View Contact Details",
    "jobid": "060815500162",
    "joblocation_address": "",
    "jobtitle": "Azure Architect",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-12-07 10:37:34 +0000",
    "site_name": "www.naukri.com",
    "skills": "IT Software - Application Programming",
    "uniq_id": "baae1a81b36f7df8b054eba4bf796570"
  },
  {
    "company": "Xoriant Solutions Pvt Ltd",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required",
    "experience": "10 - 20 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Candidates needs to have 10+ yrs of total experience and around 3-4 years of experience on Windows Azure development. I am hiring Azure Architect on consulting basis for Bangalore location. Candidates needs to have 10+ yrs of total experience and around 3-4 years of experience on Windows Azure development. Candidate will have deep expertise in Azure technologies and services as well as broad understanding on how infrastructure and applications are deployed on Azure Candidate will architect / design / deploy Azure IaaS and PaaS solutions based on a range of Azure technologies and services such as Compute, Data Services, App Services and Network Services etc Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Technical Architect Keyskills azure windows azure Cloud Computing Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required   Company Profile: Xoriant Solutions Pvt Ltd Xoriant Corporation is a product engineering and services company, serving technology startups as well as mid-size to large corporations. We offer a flexible blend of onsite, offsite and offshore services from our seven global delivery centers with over 2000 software professionals. Xoriant has deep client relationships spanning over 20 years with various clients ranging from startups to Fortune 100 companies. Xoriant's Product Development and Engineering service line offers a full life cycle software development and engineering services to independent software vendors, systems companies and companies offering enterprise, cloud, web, social networking, media and mobile applications. Our services span product development, testing, technical support, implementation and sustaining engineering. Download PPT Photo 1   View Contact Details",
    "jobid": "040816900434",
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Windows Azure Architect - Consultant/contractual Basis",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-08-04 18:44:36 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "ccdd9d344e47de5f2dd435c0430b09a7"
  },
  {
    "company": "Microsoft India (R and D) Pvt Ltd",
    "education": "UG: B.Tech/B.E. - Computers PG:M.Tech - Computers Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "15 - 18 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Standard Job Title: Support Escalation Engineer Job Category: Customer Service & Support Product: Windows Azure Division: SMSG Level: 59 Location: India (Bangalore) Travel Required: 10% Hiring Manager: mahes Role Name: Support Escalation Engineer Are you interested in the cloud business The Windows Azure Platform is strategic to Microsoft enabling customers, ISVs, and Microsoft IT to develop, test, and deploy solutions in the cloud to take advantage of economies of scale, reliability, globally distributed data centers, and generally reduce the effort of managing dedicated IT infrastructure. Azure is a growing leader in the cloud market with Azure Support enabling customer success and providing a key differentiator when customers make buying decisions. Azure Support is a strategic unit of Commercial Technical Support in CSS responsible for the following: 1. The definition and implementation of the support services required to win in the cloud market place. 2. Resolving customer issues including complex technical scenarios integrating several cloud capabilities (Windows Azure, SQL Azure, AppFabric, etc.) and scenarios supporting the service such as service availability, quality, outage management, subscription management, correlation of usage and charges, and cost efficient solution architecture. 3. Provide critical product feedback to multiple STB PGs (engineering and operations) and BGs 4. Lead the integration of CTS talent to resolve issues with specific technologies (networking, SQL, SPP, etc.) as part of Azure Support ecosystem. The opportunity for you is to be part of the evolution of Azure and cloud support services, to be constantly challenged as the Platform expands to provide broader capabilities to customers, support customers using a service rather than on-premise Microsoft products, and to work in collaboration with multiple Microsoft teams inside of CTS and the PG (Operations, STB BGs and PGs, commerce platform engineering team, etc.) Responsibilities include: The Senior Support Escalation Engineer is responsible for support delivery, working with customers to resolve, complex technical customer issues on the Windows Azure Platform. In addition, the Senior Support Escalation Engineer will focus on determining technical support scenarios, supportability asks, support workflow adjustments for Azure Previews (equivalent of Beta in on-Premise); identifying required tools, cloud access, training, processes or capabilities for support to assess issues in less than 15 minutes; and keeping escalations to PG operations below 10% of the volume. Need to closely collaborate with PG engineering and operations, and CTS engineers. The Senior Support Escalation Engineer is a critical role in the implementation of Azure Platform support capabilities which includes working with the PG and Azure Supportability PMs to implement asks; identify technology, and/or process readiness needs, and work with Training PMs and Tech Leads to ensure support team readiness; and, develop relationships with and engage with technology-specific depth queues for customer incident resolution when required. Specific measurements include achieving the CPE team goals, time to resolution or escalation, enabling a response time similar to competitors; maintaining technical skills through completion of ongoing readiness and Platform training; and, in general participating in the creation of future Microsoft support capabilities for the cloud. Qualifications: SOFT SKILLS Leadership - handle technically challenging and politically sensitive customer situations Strong communications skills - Excellent spoken and written English communication skills Effective, polished interaction with customer to gather information quickly; explain customer responsibilities in resolving issue; communicate next steps and status; and inspire confidence Demonstrable troubleshooting skills Cross-team collaboration Logical and Critical thinking Passion for technology and customer support Understanding of cloud vs. on premise computing. Familiarity with fundamentals of cloud computing. TECHNICAL SKILLS Technical understanding of the following areas with a (preferred) deep knowledge in at least one: Windows Azure Platform, Operating System/Virtualization, Networking, or Relational Database Design/Administration and networking experience. Windows Azure Platform Windows Azure architecture and its components (Fabric, Compute, Storage) Knowledge of Windows Azure Platform services Azure Platform development and deployment concepts Familiarity with development: tools, language, process, methods, troubleshooting Operating System/Virtualization Familiarity with Active Directory, Security, OS Internals concepts Understanding of Virtualization concepts and virtual system administration Familiarity with system management tools such as SCOM Experience with Hyper-V configuration and administration Networking Familiarity with networking concepts including VIPs, NAT, DNS Familiarity with networking tools (ping, tracert, tracemon, wire shark, etc.) Understanding of load balancing, geo-redundancy, CDN and VPN technologies preferred Understanding of the OSI model and related concepts Relational Database Design/Administration Familiarity with relational and document based database design methodologies Familiarity with BI data modeling and cube design concepts SQL database administration Understanding of SQL Tracing, SSIS, SSRS and SSAS Familiarity with ADO.NET preferred EXPERIENCE 3 years of support or equivalent experience including a customer facing or customer support role GENERAL Available to work critical cases as needed on a 24x7 basis or through an on-call model. Occasional domestic and international travel EDUCATION/CERTIFICATION B.S. degree in Computer Science or equivalent experience MCSE, MCPD, MCAD preferre Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - DBA , Datawarehousing Role Category:Admin/Maintenance/Security/Datawarehousing Role:Technical Support Engineer Keyskills sql networking development technical support configuration ssis microsoft database administration troubleshooting ssrs Desired Candidate Profile Education- UG: B.Tech/B.E. - Computers PG:M.Tech - Computers Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Microsoft India (R and D) Pvt Ltd Microsoft. Come as you are. Do what you love. We2019re a global company, located in over 100 countries,but we often act like a startup. We do software 2014 but we also do hardware, services, research, and community outreach. We work hard, but we value work/life balance, and each of us defines what that means to us. So why not explore what we do, where we do it, and what life is really like at Microsoft You just might be surprised. Download PPT Photo 1   View Contact Details",
    "jobid": 160216902799,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Support Escalation Engineer-azure",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-02-17 07:23:37 +0000",
    "site_name": "",
    "skills": "IT Software - DBA",
    "uniq_id": "9e312f9b35166f3ded48f39a2c74063d"
  },
  {
    "company": "Careernet Technologies Pvt Ltd",
    "education": "UG: B.Tech/B.E. - Any Specialization PG:M.Tech - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "8 - 12 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Job Description: Must have an understanding of customer and partner business and IT environment, and have demonstrated skills designing and developing technology in area(s) of specialization to solve business problems. Must have experience developing software for the Microsoft platform using programming languages and development platforms including C# or any modern programming language and Microsoft SQL Server. Participates in the delivery of complex solution as technical individual contributor or as a team member under coaching/guidance of senior team members. Strong knowledge of the Software Development Life Cycle methodology Technical design, development and implementation decisions on the use of technology in area(s) of specialization. Ability to read, interpret and/or develop Technical specifications, diagrams and database schema Validate code on customers system and educate customers team on applying the code. Work with Leads to map solution and technical information to customers context. Work with Leads on areas of local prototype, or proof of concept, to test solution. Write or modify programming code to suit customers needs. \\ Unit test to assure meets requirements, including integration test as needed. Ability to understand and analyze issues and uses judgment to make decisions. Strong problem solving & troubleshooting skills Strong communication skills Responsible for self-development according to professional development plan Areas of Expertise .NET Tools and Technologies experience of leveraging the same and designing, implementing and deploying Business Mission Critical applications. Database skills for Microsoft SQL Server development. Sound knowledge of ASP.NET MVC, WCF, WPF / Silverlight and Scripting languages would be preferred. Prior Experience in Microsoft Azure or Windows 8 Application development is a definite plus. Educational Qualification: Must have a degree in Computer Science Engineering or equivalent work experience. Higher relevant education preferred. Highly proficient & solid Customer facing Project experience involving solution design, project envisioning, planning, development and deployment of complex solutions Must have a proven record of delivering technical solutions Having a MCSD/MCSE//MCAD certification is a plus. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. - Any Specialization PG:M.Tech - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Careernet Technologies Pvt Ltd Hiring asp.net developers for a product based MNC Download PPT Photo 1   View Contact Details",
    "jobid": "080316600412",
    "joblocation_address": "Hyderabad / Secunderabad",
    "jobtitle": "Asp.net Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-07 02:30:36 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "d49440b821b050736f77f84356e539cf"
  },
  {
    "company": "Careernet Technologies Pvt Ltd",
    "education": "UG: B.Tech/B.E. - Any Specialization PG:M.Tech - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 5 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Job Description: Must have an understanding of customer and partner business and IT environment, and have demonstrated skills designing and developing technology in area(s) of specialization to solve business problems. Must have experience developing software for the Microsoft platform using programming languages and development platforms including C# or any modern programming language and Microsoft SQL Server. Participates in the delivery of complex solution as technical individual contributor or as a team member under coaching/guidance of senior team members. Strong knowledge of the Software Development Life Cycle methodology Technical design, development and implementation decisions on the use of technology in area(s) of specialization. Ability to read, interpret and/or develop Technical specifications, diagrams and database schema Validate code on customers system and educate customers team on applying the code. Work with Leads to map solution and technical information to customers context. Work with Leads on areas of local prototype, or proof of concept, to test solution. Write or modify programming code to suit customers needs. \\ Unit test to assure meets requirements, including integration test as needed. Ability to understand and analyze issues and uses judgment to make decisions. Strong problem solving & troubleshooting skills Strong communication skills Responsible for self-development according to professional development plan Areas of Expertise .NET Tools and Technologies experience of leveraging the same and designing, implementing and deploying Business Mission Critical applications. Database skills for Microsoft SQL Server development. Sound knowledge of ASP.NET MVC, WCF, WPF / Silverlight and Scripting languages would be preferred. Prior Experience in Microsoft Azure or Windows 8 Application development is a definite plus. Educational Qualification: Must have a degree in Computer Science Engineering or equivalent work experience. Higher relevant education preferred. Highly proficient & solid Customer facing Project experience involving solution design, project envisioning, planning, development and deployment of complex solutions Must have a proven record of delivering technical solutions Having a MCSD/MCSE//MCAD certification is a plus. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. - Any Specialization PG:M.Tech - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Careernet Technologies Pvt Ltd Hiring asp.net developers for a product based MNC Download PPT Photo 1   View Contact Details",
    "jobid": 100316600414,
    "joblocation_address": "Hyderabad / Secunderabad",
    "jobtitle": "Asp.net Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-09 02:30:54 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "8a4e9c0ffe4e4d10c2dd5018d56f649b"
  },
  {
    "company": "Careernet Technologies Pvt Ltd",
    "education": "UG: B.Tech/B.E. - Any Specialization PG:M.Tech - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "4 - 7 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Hiring for a reputed product based MNC for Hyderabad location. Job Role: Asp.net Developer Job Description: Must have an understanding of customer and partner business and IT environment, and have demonstrated skills designing and developing technology in area(s) of specialization to solve business problems. Must have experience developing software for the Microsoft platform using programming languages and development platforms including C# or any modern programming language and Microsoft SQL Server. Participates in the delivery of complex solution as technical individual contributor or as a team member under coaching/guidance of senior team members. Strong knowledge of the Software Development Life Cycle methodology Technical design, development and implementation decisions on the use of technology in area(s) of specialization. Ability to read, interpret and/or develop Technical specifications, diagrams and database schema Validate code on customers system and educate customers team on applying the code. Work with Leads to map solution and technical information to customers context. Work with Leads on areas of local prototype, or proof of concept, to test solution. Write or modify programming code to suit customers needs. \\ Unit test to assure meets requirements, including integration test as needed. Ability to understand and analyze issues and uses judgment to make decisions. Strong problem solving & troubleshooting skills Strong communication skills Responsible for self-development according to professional development plan Areas of Expertise .NET Tools and Technologies experience of leveraging the same and designing, implementing and deploying Business Mission Critical applications. Database skills for Microsoft SQL Server development. Sound knowledge of ASP.NET MVC, WCF, WPF / Silverlight and Scripting languages would be preferred. Prior Experience in Microsoft Azure or Windows 8 Application development is a definite plus. Educational Qualification: Must have a degree in Computer Science Engineering or equivalent work experience. Higher relevant education preferred. Highly proficient & solid Customer facing Project experience involving solution design, project envisioning, planning, development and deployment of complex solutions Must have a proven record of delivering technical solutions Having a MCSD/MCSE//MCAD certification is a plus. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. - Any Specialization PG:M.Tech - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Careernet Technologies Pvt Ltd Hiring asp.net developers for a product based MNC Download PPT Photo 1   View Contact Details",
    "jobid": "020316600494",
    "joblocation_address": "Hyderabad / Secunderabad",
    "jobtitle": "Asp.net Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-01 02:31:21 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "e9b3ea84ed22fb7878de391be75e4e29"
  },
  {
    "company": "Volantis Technologies Pvt Ltd.",
    "education": "UG: B.Tech/B.E. - Any Specialization PG:M.Sc - Any Specialization, M.Tech - Any Specialization, MCA - Computers, M.S/M.D - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "9 - 14 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Software Architect Over 9+ years of experience in designing and developing web applications using Microsoft .NET technologies Must have experience in designing software applications using Microsoft .net, C# and MVC Must have experience in Microsoft SQL server 2008 Must have experience in front end technologies such as JQuery, Angular, knockout or backbone js Must have experience in designing high performance and Real time data processing application Must have experience in developing software frameworks and software designs specifications. Must have experience in Test driven development Must have experience in agile development methodologies Must have excellent communication skills Desired skills Experience in porting Ruby on Rails application to .NET Experience in setting software development processes and procedures Experience in creating UML diagrams, sequence diagrams and design documents. Experience in writing pseudo code and developing POCs Experience in designing and development software application for Azure Experience in developing responsive UI applications Experience in HTML5 application development. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: Architecture , Interior Design Role Category:Architectural Services Role:Architect Desired Candidate Profile Education- UG: B.Tech/B.E. - Any Specialization PG:M.Sc - Any Specialization, M.Tech - Any Specialization, MCA - Computers, M.S/M.D - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Volantis Technologies Pvt Ltd. - Download PPT Photo 1   View Contact Details",
    "jobid": "010416601000",
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Software Architect",
    "numberofpositions": 4,
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-31 07:23:59 +0000",
    "site_name": "",
    "skills": "Architecture",
    "uniq_id": "765165437129b32a4899fee33a490146"
  },
  {
    "company": "Bob Technologies",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate Doctorate:Doctorate Not Required",
    "experience": "10 - 15 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this We have an urgent requirement for the post of MS Cloud Architect with one of our client in Bangalore, Position : MS Cloud architect Exp:10+yrs Location :Bangalore NP: Max 30 Days Required Experience & Skills Min of 10+ years of experience in technology consulting, enterprise and solutions architecture and architectural framework At least Minimum 6+ years of experience leading architecture, design, development and implementation of technical solutions at an enterprise level. 4+ years of designing and implementing complex solution Cloud solutions, Previous, demonstrated experience migrating an on premise environment to an Azure, AWS, Google Good understanding of MS technology stack (NET, ASP.Net, MVC, C#), UI frameworks (Angular, Dojo, HTML, CSS, JSS), Microsoft Active Directory and MS SQL Server Good with scripting or programming using XML, JSON, Expertise on Devops cloud devops mechanisms, chef, terraform, docker awareness Iaas, Paas knowledge on cloud either Azure or AWS. Expertise on Cloud applications and services authentication, monitoring and maintaining applications, System Center / New Relik etc Expert level knowledge of architecting service oriented architecture with high availability and scalability Analytical skills & Ability to work independently in a fast paced environment Excellent communication skills and ability to collaborate in a multi-disciplinary team Experience in providing cloud advisory and consulting services to customers including assessments, presenting recommendations on Azure migration road maps, architecture / designs etc. Detailed knowledge of software development life-cycles, including agile methods Strong experience with automated testing, continuous integration, unit testing and Test Driven development Experience with leading development in a distributed team environment TOGAF 2, MSCE, MCITP preferred. Key Responsibilities Role requires the resource to lead the consultative discovery of the clients business goals, objectives, and challenges, and then translates them into effective solutions Will be responsible for the leadership and delivery of pre-sales and project-based assignments including solution development, proof-of-concept, analysis, design/architecture, deployment and support of the Microsoft Azure/technology platforms: Design, planning and implementation of cloud based solution and enterprise applications Identify and implement appropriate solution for any technical issues Own each technical challenge and lead technical analysis and architecture Guide in-house engineers and build capability to develop with best quality software solutions Collaborate with product managers, designers, QA engineers, Ops engineers and other Stakeholders to keep projects moving efficiently Capture and share best-practice knowledge amongst the development team. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Technical Architect Keyskills ASP.Net MVC HTML Azure CSS MS SQL Server XML C# JSON Architecting Desired Candidate Profile   Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate Doctorate:Doctorate Not Required Company Profile: Bob Technologies Bob Technologies Download PPT Photo 1   View Contact Details",
    "jobid": "061016900689",
    "joblocation_address": "Bengaluru",
    "jobtitle": "MS Cloud Architect",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-10-07 16:21:26 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "e217fb0f34f419353cbbbabe2b2e66db"
  },
  {
    "company": "Talpro",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Doctorate Not Required",
    "experience": "3 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Personal Profile You will be a highly creative Graphic Designer with an obvious passion for your work, and an exciting portfolio of original work from a variety of media with a bias towards digital. Your work will show communication of ideas through unique and inspired design. Your broad range of influences and ability to think laterally will show a different perspective and new and exciting ways to tackle a brief. You will be passionate about good graphic design and innovation. Responsibilities: - Design, creation and implementation of high quality pixel accurate 2D graphics. - To work with product management to create and develop mock-ups to establish user interface direction and innovation. - To propose design styles that are informed by current trends in graphical design, but are not restricted to them. - Actively contribute to product Brainstorming, User research, Interaction design and Visual design sessions. - Support UX Design for products, which caters to User Goals by proposing new Interactions and User Flows. - Propose Low-fidelity and High-fidelity wireframes based on Project Requirements. - Collaboration with wider project team to develop and sustain visual consistency across branded product ranges. - Working closely with UI programmers to ensure correct functionality and visual fidelity. - To work as part of an international research and development team. - Support product management in working out detailed specification. - To produce and maintain accurate supporting documentation and be familiar with the appropriate software development tools, keeping up to date with technology advances in areas related to the market and the software arena. - To use innovative techniques to give products the edge over their competitors. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: Design , Creative , User Experience Role Category:Creative Role:Graphic Designer Keyskills Product Design Graphic Designing UI implementation Illustrator Wireframe Photoshop Brainstorming User research Interaction design Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required Doctorate:Doctorate Not Required Required Education and Experience:- Bachelor\"s degree in Graphic Design, User Interface Design or similar.- Demonstrate a portfolio showing strong artistic and graphic design layout skills and a high level of originality and creativity.- Minimum Experience required 2-4 Yrs for Engineer, SW and 5+ yrs for Sr Engineer SWRequired Skills:- Excellent understanding of visual communication techniques and typography.- Awareness of current trends in GUI, web and general media graphics design style, but able to work in other styles.- Knowledge of Industrial design considerations such as high-contrast/outdoor visible, functional groupings and priorities, and understanding of concept of \"consistency\" within a GUI design.- To maintain focused attention on the smallest detail as well as the big picture.- Strong knowledge of Photoshop & Illustrator.- Ability to work to individual and team deadlines.- Must be fluent in both written and spoken English.- Ability to effectively communicate within a large group/multiple project environment.- Knowledge of professional audio equipment and its application is an advantage. Company Profile: Talpro Leading client of Talpro Download PPT Photo 1   View Contact Details",
    "jobid": 180216900216,
    "joblocation_address": "Delhi/NCR(National Capital Region) , Bengaluru/Bangalore",
    "jobtitle": "Sr Product Designer - Graphic/ui",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-02-18 07:23:32 +0000",
    "site_name": "",
    "skills": "Design",
    "uniq_id": "e05982216bfce92da0dc05211fdf412a"
  },
  {
    "company": "THINK DESIGN COLLABORATIVE PVT. LTD",
    "education": "UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 5 yrs",
    "industry": "Internet / Ecommerce",
    "jobdescription": "Job Description   Send me Jobs like this A Visual Designer is qualified in any of the following disciplines: Degree in Graphic Design/ Applied arts Diploma in Multimedia with experience in UX Design Diploma or Degree in communication design with demonstrable inclination towards digital design This person is highly skilled in latest versions of software for executing deliveries (Photoshop, Illustrator, Icon designer etc.,) and at the same time, is well versed with tools and techniques required to generate delivery item such as layouts, icons etc.,. At Think Design, he executes delivery of visual design work. He will be taking inspiration from Visual Design direction provided by Lead Visual Designer and will be reporting directly to Lead UX Designer. He may be interacting with Front-end teams time to time during project delivery period Deliverables Depending on client requirements, the Visual Designer will be responsible for delivering all or some of the following. Page Layouts Icons Layout specifications Prototypes Responsibilities A Visual Designer will have the following responsibilities. Should be disciplined in delivering as per planned schedule Needs to negotiate with and help Front-end delivery teams and provide support through the front end coding period Quickly generate page layouts as per direction provided by Visual Design Lead Stay up-to-date with latest achievements, best practices and trends in design Able to communicate internally with teams and possibly provide solutions when required As a visual designer, needs to prepare Photoshop files in semantic and layered format He needs to have the technical competency to deliver the items mentioned above Salary: Not Disclosed by Recruiter Industry: Internet / Ecommerce Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Graphic/Web Designer Keyskills photoshop coding multimedia illustrator front end layout tools digital design ux diploma Desired Candidate Profile Education- UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: THINK DESIGN COLLABORATIVE PVT. LTD Since 2004, weve designed every aspect of human interface across touch points and technologies. We will continue to be in the space where customers are interacting with businesses, for consuming information, carrying out daily tasks, making decisions or buying things. Download PPT Photo 1   View Contact Details",
    "jobid": 230715501172,
    "joblocation_address": "Bengaluru/Bangalore , Bengaluru / Bangalore , Delhi , Hyderabad/Secunderabad , Mumbai",
    "jobtitle": "Visual Designer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-01-29 14:07:20 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "f4c9a88d250bd8166e1951f50d00dbbe"
  },
  {
    "company": "Adams Creation",
    "education": "UG: Diploma PG:MCA Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 4 yrs",
    "industry": "Media / Entertainment / Internet",
    "jobdescription": "Job Description   Send me Jobs like this Should have completed applied art degree (BFA or MFA) in Visual Design or equivalent. Innovative, Creative and should be able to do creative sketches. You must be proficient in Adobe Photoshop, Illustrator and have excellent creative skills. Should be able to think creatively to produce new ideas and concepts. Should keep yourself updated of emerging technologies in new trends and media, particularly design programs such as Illustrator, Photoshop. Salary: Not Disclosed by Recruiter Industry: Media / Entertainment / Internet Functional Area: Design , Creative , User Experience Role Category:Creative Role:Graphic Designer Keyskills illustrator visual design ideas adobe photoshop creative skills graphic designer sketches mfa do programs Desired Candidate Profile Education- UG: Diploma PG:MCA Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Adams Creation AdamsCreation is a Bangalore-based full-fledged advertising agency. From a graphic design shop in 2004, we are now a complete advertising agency. Us being small is our biggest advantage. We take on limited projects so that we can allocate all our bandwidth and work with our clients to create the best possible solution Download PPT Photo 1   View Contact Details",
    "jobid": 250715500399,
    "joblocation_address": "Bengaluru/Bangalore , Bengaluru / Bangalore",
    "jobtitle": "GRAPHIC DESIGNER",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-01-29 14:07:17 +0000",
    "site_name": "",
    "skills": "Design",
    "uniq_id": "1562280bb0e174ff1659e97256d42e9f"
  },
  {
    "company": "Financial Software Systems Pvt. Ltd.",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required, MBA/PGDM - Any Specialization, Marketing Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 3 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Key Responsibilities: Think creatively and develop new design concepts, graphics and layouts of electronic and print materials like flyers, posters, banners, collaterals, logos, invitations, postcards, newsletters, newspaper ads, etc. Carrying design projects from concept to completion while adhering to the brand standards Maintaining and enhancing corporate website by adding and improving design and interactive features Understanding and ability to create responsive design and development Skills & Qualifications: Formal graphic design training Ability to interact, communicate and present ideas Excellent knowledge of common industry applications Corel Draw, Adobe Photoshop, Illustrator, In Design Knowledge of Dream Weaver, HTML5, CSS3 and jQuery Understanding of production, print and web-based technologies Salary:INR 2,00,000 - 3,00,000 P.A Industry: IT-Software / Software Services Functional Area: Design , Creative , User Experience Role Category:Creative Role:Graphic Designer Keyskills Adobe Photoshop Corel Draw Adobe Illustrator adobe flash Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization, Post Graduation Not Required, MBA/PGDM - Any Specialization, Marketing Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Financial Software Systems Pvt. Ltd. fsstech.co.in Download PPT Photo 1   View Contact Details",
    "jobid": 131115001875,
    "joblocation_address": "Chennai",
    "jobtitle": "Graphic Designer",
    "numberofpositions": 2,
    "payrate": "2,00,000 - 3,00,000 P.A",
    "postdate": "2015-11-28 01:33:27 +0000",
    "site_name": "",
    "skills": "Design",
    "uniq_id": "a0377dd2641bb8ec7ac76b25d2d89dad"
  },
  {
    "company": "STUDIO BRAHMA PVT. LTD.",
    "education": "UG: B.Sc PG:MCA Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 7 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Job Description : Degree / diploma in Graphic Design - Minimum 1 - 2 years graphic design experience / Freshers will also be considered with exceptional skill & talent. - Strong verbal communication and presentation skills - Proficient in graphic design programs (Photoshop , Illustrator , InDesign) & Excellent sketching and drawing abilities - Comfortable working in Macintosh - Good understanding of design / print production processes - Ability to apply creativity to real - world problems - Person must be able to work as a creative member of a project team , and as a productive member among the staff in his / her discipline Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: Design , Creative , User Experience Role Category:Creative Role:Graphic Designer Keyskills photoshop diploma sketching illustrator indesign graphic design presentation skills verbal communication production graphic designer Desired Candidate Profile Education- UG: B.Sc PG:MCA Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: STUDIO BRAHMA PVT. LTD. Studio Brahma is a creative agency, focusing on the integration of design and technology to create communication tools for individuals and organizations. Our goal is to facilitate growth and reachability for clients to connect to their target audience and build market presence. Download PPT Photo 1   View Contact Details",
    "jobid": 150715500951,
    "joblocation_address": "Noida , Noida/Greater Noida",
    "jobtitle": "Graphic Designer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-23 22:18:00 +0000",
    "site_name": "",
    "skills": "Design",
    "uniq_id": "20bc2d3126ee7fcb84be4dbcbd63fb3f"
  },
  {
    "company": "STUDIO BRAHMA PVT. LTD.",
    "education": "UG: B.Sc PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "1 - 2 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Minimum 1 - 2 years graphic design experience / Freshers will also be considered with exceptional skill & talent. - Strong verbal communication and presentation skills - Proficient in graphic design programs (Photoshop , Illustrator , InDesign) & Excellent sketching and drawing abilities - Comfortable working in Macintosh - Good understanding of design / print production processes - Ability to apply creativity to real - world problems - Person must be able to work as a creative member of a project team , and as a productive member among the staff in his / her discipline Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: Design , Creative , User Experience Role Category:Creative Role:Graphic Designer Keyskills photoshop sketching illustrator indesign presentation skills graphic design design communication verbal communication graphic designer Desired Candidate Profile Education- UG: B.Sc PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: STUDIO BRAHMA PVT. LTD. Studio Brahma is a creative agency, focusing on the integration of design and technology to create communication tools for individuals and organizations. Our goal is to facilitate growth and reachability for clients to connect to their target audience and build market presence. Founded eight years back by a handful of like minded individuals, the studio has grown into a strong team of professionals from diverse backgrounds of art, animation, architecture, visual communication and software development. Together we share, learn and foster our creative and technical skill sets to sustain our abilities as a cutting edge design and production facility. Download PPT Photo 1   View Contact Details",
    "jobid": 150715500936,
    "joblocation_address": "Noida , Noida/Greater Noida",
    "jobtitle": "Graphic Designer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2015-11-22 22:18:09 +0000",
    "site_name": "",
    "skills": "Design",
    "uniq_id": "db250de1561955bb38b046f5bb78468d"
  },
  {
    "company": "Kmindz Advisory Sevices hiring for Leading Manufacturing Organisation",
    "education": "UG: Diploma - Any Specialization, Graphic/ Web Designing, B.Sc - Any Specialization, Other Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required",
    "experience": "2 - 7 yrs",
    "industry": "Automobile / Auto Anciliary / Auto Components",
    "jobdescription": "Job Description   Send me Jobs like this MUST HAVE HANDS ON EXPERIENCE INTO ADOBE PHOTOSHOP, ILLUSTRATOR, CORAL DRAW PRODUCTS GRAPHICS / PRODUCTS BASED DESIGN GOOD COMM SKILLS Salary: Not Disclosed by Recruiter Industry: Automobile / Auto Anciliary / Auto Components Functional Area: Design , Creative , User Experience Role Category:Creative Role:Graphic Designer Keyskills Graphic Design Graphic Designer Graphics Designs Graphic Designs Graphic Designing Visualizer illustrator Desired Candidate Profile Education- UG: Diploma - Any Specialization, Graphic/ Web Designing, B.Sc - Any Specialization, Other Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required MUST HAVE HANDS ON EXPERIENCE INTO ADOBE PHOTOSHOP, ILLUSTRATOR, CORAL DRAW PRODUCTS GRAPHICS / PRODUCTS BASED DESIGN GOOD COMM SKILLS Company Profile: Kmindz Advisory Sevices Leading Manufacturing Organisation LEADING MANUFACTURING ORGANISATION (AUTOMOBILE) Download PPT Photo 1   View Contact Details",
    "jobid": "040516006811",
    "joblocation_address": "Ghaziabad , Ludhiana",
    "jobtitle": "Graphic Designer",
    "numberofpositions": 2,
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-05-04 11:35:37 +0000",
    "site_name": "",
    "skills": "Design",
    "uniq_id": "57dcb59e90ce1dbd40b96c0045f5b124"
  },
  {
    "company": "First Call H Resource P. Ltd",
    "education": "UG: Any Graduate - Any Specialization",
    "experience": "2 - 7 yrs",
    "industry": "KPO / Research / Analytics",
    "jobdescription": "Job Description   Send me Jobs like this Job Description for Assistant Manager - Design & Creative Services If you live, breathe, sleep Design & Creative Serviceswe want to talk to you! Responsibilities: Create designs, concepts, and sample layouts based on your knowledge of layout principles and aesthetic design concepts to cultivate a solid body of work. Determine size and arrangement of illustrative material and copy, and select style and size of type. Take design briefs from stakeholders. Schedule project implementation Confer with stakeholders to discuss and determine layout design. Work with a wide range of media and use graphic design software. Develop creative new design concepts, graphics and layouts for all requirements. Review final layouts and suggest improvements as needed. Prepare illustrations or rough sketches of material to present your ideas, discussing them with stakeholders or supervisors and making necessary changes based on stakeholder comments to gain full approvals. Use computer software to generate new images. Key information into computer equipment to create layouts for stakeholders or supervisors. Maintain archive of images, photos, or previous work. Create final artworks for printer/printing. Prepare notes and instructions for printer/printing. Draw and print charts, graphs, illustrations, and other artwork, using computer. Study illustrations and photographs to plan presentation of materials, products, or services. Research new software or design concepts. Produce still and animated graphics for videos. Photograph layouts, using camera, to make layout prints for supervisors or stakeholders Requirements Minimum 6 years of proven graphic designing & related experience Possession of creative flair, versatility, conceptual/visual ability and originality Demonstrable graphic design skills with a strong portfolio Ability to interact, communicate and present ideas Up to date with industry leading software and technologies (In Design, Illustrator, Dreamweaver, Photoshop etc.) Highly proficient in all design aspects and in meeting time & cost deadlines Salary:INR 6,00,000 - 11,00,000 P.A Industry: KPO / Research / Analytics Functional Area: Design , Creative , User Experience Role Category:Creative Role:Graphic Designer Desired Candidate Profile Please refer to the Job description above Education- UG: Any Graduate - Any Specialization Company Profile: First Call H Resource P. Ltd It's for an international MNC located at Mumbai. Download PPT Photo 1   View Contact Details",
    "jobid": "081116600192",
    "joblocation_address": "Mumbai",
    "jobtitle": "AM Graphic Designing",
    "numberofpositions": "",
    "payrate": "6,00,000 - 11,00,000 P.A",
    "postdate": "2016-11-07 19:48:32 +0000",
    "site_name": "www.naukri.com",
    "skills": "Design",
    "uniq_id": "ff4ce7df9bbef1fca33dce93a9e5c256"
  },
  {
    "company": "Bee5 Manpower Consulting",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required",
    "experience": "6 - 11 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Create mobile designs for users on Android platform, including visual and motion graphics, flash animation to explain the concepts. Asset creations, icon design for final deliverable for release of phone. Refer detail JD at: http://goo.gl/hCCvtm Salary:INR 18,00,000 - 33,00,000 P.A. Present ideas and designs, User interface visually to enable users with info. which is easy to read, understand and find. Exceptional skills in graphic and functional aspects of design and ability to execute both. Strong and creative portfolio with v Industry: IT-Software / Software Services Functional Area: IT Software - Mobile Role Category:Programming & Design Role:Graphic/Web Designer Keyskills Flash Animation Visual and Motion Graphics Asset creations icon design Adobe design software Photoshop Illustrator Dreamweaver Flash Adobe Suite UI and UX Design for Mobile Portfolio with varied Projects Translate concepts into Visual Form Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Doctorate Not Required B.Design 6+ Yrs exp in UI/ UX Design. Translate concepts into a visual form, depicting conceptual logic for each design decision. Proficient in Adobe design software Photoshop, Illustrator, Dreamweaver, Flash. Refer detail JD at: http://goo.gl/hCCvtm Company Profile: Bee5 Manpower Consulting It is VC funded company by first gen. entrepreneurs/ Tech Geeks from IIT-Mumbai with recog. from Red Herring as Top 100 Asia Co. More than 60% of its tech team is from pedigree like IITs, NITs, BITs from companies like Google, Samsung, Microsoft etc. Download PPT Photo 1   View Contact Details",
    "jobid": 191215002679,
    "joblocation_address": "Mumbai",
    "jobtitle": "Head UI and UX Design Mumbai",
    "numberofpositions": 1,
    "payrate": "18,00,000 - 33,00,000 P.A. Present ideas and designs, User interface visually to enable users with info. which is easy to read, understand and find. Exceptional skills in graphic and functional aspects of design and ability to execute both. Strong and creative portfolio with v",
    "postdate": "2016-05-05 01:22:02 +0000",
    "site_name": "",
    "skills": "IT Software - Mobile",
    "uniq_id": "77453cda820381576d729f42a3af6b6f"
  },
  {
    "company": "Easton Media",
    "education": "UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 7 yrs",
    "industry": "Advertising / PR / MR / Event Management",
    "jobdescription": "Job Description   Send me Jobs like this Experience 2+ Yrs and Above Design Skill in Logo Design & Sketch Exp. in Brochure Design, Catalogue Design, Flyer Design, Poster Design & Packaging Design  Creative Skill Art work Sketching Concept Development Leadership Quality Good communication A true passion for design, creativity and innovation Self-motivated, shows initiative and is a quick learner Demonstrated creative judgement and design sensibility Salary:INR 1,50,000 - 3,50,000 P.A Industry: Advertising / PR / MR / Event Management Functional Area: Design , Creative , User Experience Role Category:Creative Role:Graphic Designer Keyskills Graphic Designing Design and Creative Creative Designing Adobe Photoshop Coral Draw Adobe Illustrator Design and Creative and User Experience Print Designing Web Designing Packaging Design Graphic Designer Creative Designer Desired Candidate Profile Education- UG: Any Graduate - Any Specialization PG:Any Postgraduate - Any Specialization Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Easton Media Easton Media is an integrated marketing communications company committed to offer a customized and collaborative approach to help our clients build their brands successfully. It is the passion and creativity that drives us to create clutter-breaking work for our clients. Visit: www.eastonmedia.com Easton Media Works #15 A, Creative House, P.T. Rajan Salai, K K Nagar, Chennai - 600078. 044 2366 2377 / 044 4383 6098 Download PPT Photo 1   View Contact Details",
    "jobid": 231115004702,
    "joblocation_address": "Chennai",
    "jobtitle": "Creative Graphic Designer",
    "numberofpositions": 4,
    "payrate": "1,50,000 - 3,50,000 P.A",
    "postdate": "2015-11-23 01:33:34 +0000",
    "site_name": "",
    "skills": "Design",
    "uniq_id": "8a764eb9d605321b855f4ba0c0ce032e"
  },
  {
    "company": "Praneet Soft Solutions",
    "education": "UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Skills Required: 0-2 years of working experience in Web Development (PHP) . Excellent programming skills - preferably in PHP, Oops, Mysql, PHP Frameworks, SOAP, AJAX, JSON, XML, CSS, Javascript & JQuery. Good knowledge of Semantic Coding, web2. 0 & web3. 0 concepts. Knowledge of HTML / XHTML / DHTML. Job Responsibilities: Work as a part of the relevant development team. Should have responsible attitude and exceptional analytical & listening skills to analyze requirement and complete the task within optimum timelines. Needs to have keenness and flexibility to work extended hours as well as in strict environment. Input Designers to develop the best design Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: Praneet Soft Solutions leading IT/ITES corporate consultancies offering Training, Software Services and Consultancy Services as per the end user requirements Download PPT Photo 1   View Contact Details",
    "jobid": "040316500819",
    "joblocation_address": "Ahmedabad , Bengaluru / Bangalore , Hyderabad/Secunderabad",
    "jobtitle": "PHP Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-04 02:30:42 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "d104222ac321cf51e91b73900fa67edb"
  },
  {
    "company": "Okda Solutions",
    "education": "UG: Any Graduate - Any Specialization, B.Tech/B.E. - Any Specialization, Computers, Electrical, Electronics/Telecommunication PG:Any Postgraduate Doctorate:Doctorate Not Required",
    "experience": "7 - 10 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Responsibilities : - Create functional specifications, carry out feasibility analysis and provide effort estimation - Participate in Design, Development, Testing and Maintenance of Software Products - Be an integral part of the software development team to understand source control, build, testing, branching, and release needs that need to be part of the Software Development Environment - Lead root cause analysis of software and system defects and work with a complex code base, taking the initiative to solve problems and provide clean solutions. - Analyze existing software products and recommend new technical developments. - Improve the functionality, reliability, performance, usability of the Software Products - Create and maintain product technical documentation - Contribute to the development of key guidelines to provide standardization of effort throughout all products. - Comply with good software engineering principles, including but not limited to standard coding, documentation, version control and testing practices - Work closely with other team members in an Agile development environment. - Work efficiently with minimum supervision. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Keyskills Java J2Ee Software Development Software Engineering Agile Development Coding Version Control Feasibility Analysis Development Testing Design Development Desired Candidate Profile Preferred Qualifications : - 7+ years of Professional software development experience in Java/J2EE - Strong front-end web development experience with HTML5, CSS4 and JavaScript libraries like jQuery, D3, RequireJS, and Backbone - Solid understanding of AJAX and object-oriented JavaScript programming - Strong technical aptitude and experience with the following technologies: Web 2.0, REST and NodeJS - Previous experience designing, developing and deploying solutions that involve integration using well-published APIs (REST, SOAP, RPC etc). - Experience with SQL and a variety of RDBMS environments (MySQL, PostgreSQL, etc) - Experience with Distributed Version Control Systems. GIT is preferred - Strong experience in Maven and Continuous Integration tools like Jenkins or Bamboo - Experience working with Atlassian tools is preferred - Strong ability to apply analytical and problem-solving skills to solve complex design and coding challenges. - Ability to work as a valued team player in a fast-paced environment in small teams - Strong working knowledge of software build, packaging, release management and installation process. - Expertise in using project planing and management software. - Experience with Agile software development methodologies. - Ability to interact with any level within an organization. - Ability to self-motivate and multi-task. - Ability to work independently and as part of a team. - B.E/B.Tech in EE, EECS, CS, MIS or comparable discipline - Excellent verbal and written English. Education- UG: Any Graduate - Any Specialization, B.Tech/B.E. - Any Specialization, Computers, Electrical, Electronics/Telecommunication PG:Any Postgraduate Doctorate:Doctorate Not Required Company Profile: Okda Solutions Leading client of Okda Solutions Download PPT Photo 1   View Contact Details",
    "jobid": 221216902588,
    "joblocation_address": "Hyderabad",
    "jobtitle": "Full Stack Developer - Java/ J2EE",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-12-23 18:19:15 +0000",
    "site_name": "www.naukri.com",
    "skills": "IT Software - Application Programming",
    "uniq_id": "f511872f5842801c6b136f021221d417"
  },
  {
    "company": "AllianceData",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "6 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Summary The position is primarily responsible for providing hands- on design and implementation expertise for creating compelling concepts for mobile products and offerings as well as engaging user experience across mobile and web platforms. The positions purpose includes, but is not limited to: Setup/ configuration of the development environment Analysis and design of new and enhanced features for the marketing platform as per business requirements Communication with QA, product and production support teams etc. to deliver new or enhanced features and address issues/ concerns Development of features as per design provided Assistance of Production Support team for troubleshooting issues Development work for automation of operational tasks. Support system patch or version upgrade Assist with reporting tasks Duties and responsibilities Develop and enhance Mobile Application using HTML5, PhoneGap, jQuery Mobile, JavaScript and CSS3 Define technical design for mobile application eco system (enterprise integration working with REST services, Vendor Mobile APIS, Push notifications, etc.) . Setup developer accounts to publish apps to the Google Play Store and Apple App Store. Integrate available plugins to utilize native phone APIs to handle push notifications, geo- location, and payment processing (Google Wallet, Apple Pay, etc.) Potentially dig down into the native layer to develop custom plugins to achieve desired functionality if not supported by the chosen framework Provide a creative source of ideas/ solutions to address problems strategic and tactical. Design the necessary processes required to support and enhance the mobile application ecosystem. Contribute to the improvement of the efficiency of through scripts, tool code, component development or methodology enhancement. Develops, maintains, monitors, and tunes performance of the applications. Collaborate with developers, project managers, business analysts and business users in conceptualizing, estimating and developing new software applications and enhancements. Assist in defining software development project plans, including scoping, scheduling, providing time estimates for programming tasks and implementation plans. Assist in the definition, development, and documentation of softwares objectives, business requirements, deliverables, and specifications in collaboration with internal users and departments. Develop technical documentation to define the system components, development environment and implementation planning/ strategies Prepare and dispense work assignments, provide guidance, and/ or review the work of other team members. Collaborate with QA team to define test cases, metrics, and resolve questions about test results. Recommend business process flow improvements and clearly communicate problem/ resolution process to project management. Perform root cause analysis (RCA) Work with cross- functional teams during crisis to address and resolve complex incidents and problems in addition to assessment, analysis, and resolution of cross- functional issues. Recognizes and identifies potential areas where existing policies and procedures associated with development requires improvement and helps in the process improvement activity. Update/ create Knowledge Base Articles and case studies as necessary. Assist in the creation and improvement of Knowledge Management Qualifications Minimum qualifications Developer with 6- 8 years of experience required. 3 years of Web Development, specifically in the areas of mobile application and web design. Must have experience with hybrid mobile applications in jQuery, integration of Google and other third- party APIs, leveraging existing databases and data sources. Development Skill Set: HTML5, JavaScript, jQuery Mobile, jQuery, angular.js, Bootstrap, CSS3, PhoneGap iPhone/ Android/ Blackberry platform deployment experience Understanding of mobile technologies and platform differences Strong experience with MySQL, SQL Server and TFS. Ability to design and implement solutions that are reliable, scalable, and perform at a high- level to meet the service levels associated with mission- critical solutions. Excellent in impact- analysis and root cause analysis. Proven analytical and problem- solving abilities with ability to anticipate and avoid problems. Experience in application monitoring and support of production applications with distributed teams. Ability to define and implement migration strategies from legacy systems to new architecture and technologies. Ability to work well within a team environment that includes geographically distributed team members. Ability to work within tight deadlines and effectively prioritize and execute tasks in a high- pressure environment. Strong communication skills (verbal and written) and an ability to communicate with internal and external customers and all levels of management, including communicating technical information to nontechnical audiences. Ability to design and build flexible and extensible systems with focus on code reuse and generation. Experience with writing detailed technical specifications for developers; design, validate and execute software test plans. Familiar with Application Development Life Cycle and be able to independently participate in each components. Education: Bachelors degree in Computer Science, or equivalent Preferred qualifications Technical o Experience with ionic and Apache Cordova o Working knowledge of Oracle databases and PL/ SQL, Unix environment and capable of Unix Shell scripting. o Experience in automotive marketing and/ or CRM applications preferred. o Experience with ETL tool preferred. Non- Technical: o Good Analytical and problem solving skills. o Ability to diagnose and troubleshoot problems quickly to maintain operational stability. o Motivated to learn new applications and domain. o Possess appetite for learning through exploration and reverse engineering. o Strong time management skills. o Ability to take full ownership of tasks and projects. Behavioral Attributes: o Team player with excellent interpersonal skills. o Good verbal and written communication. o Possess Can- Do attitude to overcome any kind of challenges. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AllianceData AllianceData Download PPT Photo 1   View Contact Details",
    "jobid": 310316506343,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Senior Mobile Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-31 07:23:58 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "922d13b8f5445ceb9fd071e770d8aea4"
  },
  {
    "company": "zNoow Technologies Pvt. Ltd",
    "education": "UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "3 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this DESCRIPTION Are you passionate about programming Do you enjoy learning and staying current with the latest in languages, platforms and development environments Do you bring others up to your level Do you thrive in a challenging environment We are looking for a PHP Developer who is dedicated to his craft. We need you to support our existing infrastructure while recommending ongoing improvements. Candidate will also be responsible for all aspects of the ongoing software development lifecycle from initial specification, to developing, testing, and deployment of code. RESPONSIBILITIES Designs and develops user interfaces to Internet/ intranet applications by setting expectations and features priorities throughout development life cycle; determining design methodologies and tool sets; completing programming using languages and software products; designing and conducting tests. Writes \"clean\", well- designed code. Troubleshoot, test, and maintains the core product software and data store to ensure strong functionality and optimization. Supports users by developing documentation and assistance tools. Updates job knowledge by researching new internet/ intranet technologies and software products; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations. Follows industry best practices.POSITION REQUIREMENTS Bachelor's Degree in Computer Science, or related field, and 3- 4 years of software development experience. Understanding of SOAP API Previous Experience with codeigniter Understanding of Basic OOPs concept Proven experience writing PHP applications. Excellent analytical and problem solving skills with the ability to think quickly and offer alternatives. Organized, goal- oriented, motivated self- starter who can work well in a team environment. Working knowledge of agile software development life- cycle.ADDITIONAL SKILLS Experience with 3rd Party API Integration. Experience with CMS application like WordPress and Magento is a plus) . Experience with HTML5, Mobile Device Development. Experience with version control systems. Good knowledge of relational databases, version control tools, and developing web services (e.g. SOAP, REST) . Experience with Quality Assurance and testing of web applications or software.PERSONAL CHARACTERISTICS Energetic, comfortable working in a fast- paced environment. Hard- working and motivated, able to take initiative and meet deadlines. Comfortable working in a diverse, team- based environment. Detail oriented, well- organized and excellent ability to multi- task. Excellent communication, presentation, and interpersonal skills. A hands- on attitude in a friendly work environment. Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: zNoow Technologies Pvt. Ltd zNoow Technologies Pvt. Ltd Download PPT Photo 1   View Contact Details",
    "jobid": "040516500669",
    "joblocation_address": "Delhi",
    "jobtitle": "Sr. PHP Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-05-04 06:05:59 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "6302fb3bb23c3261e237fd7a3fab971d"
  },
  {
    "company": "AllianceData",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "8 - 10 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Summary This position is responsible for leading the development, implementation and maintenance of .net based applications and components for the automotive marketing platform. Duties and responsibilities Responsible for maintenance of applications with technologies such as .NET C#/ SQL Server/ Oracle/ jQuery/ HTML5/ Javascript/ Angular/ Bootstrap. Collaborate with developers, project managers, business analysts and business users in conceptualizing, estimating and developing new software applications and enhancements. Responsible for defining software development project plans, including scoping, scheduling, providing time estimates for programming tasks and implementation plans. Assist in the definition, development, and documentation of softwares objectives, business requirements, deliverables, and specifications in collaboration with internal users and departments. Develop technical documentation to define the system components, development environment and implementation planning/ strategies Prepare and dispense work assignments, provide guidance, and/ or review the work of other team members. Collaborate with QA team to define test cases, metrics, and resolve questions about test results. Recommend business process flow improvements and clearly communicate problem/ resolution process to project management. Develops and implements solutions in accordance with policies and procedures. Facilitate the design and implementation process for new products/ projects, informing senior executive of alternatives. Analyze user requests and assist with design activities. Provide in- depth and strong technical specialty and knowledge to the team. Develop components based on business and/ or application requirements Create unit tests in accordance with team policies & procedures Work closely with the QA team to identify and implement appropriate manual and automated functional tests Advise, and mentor team members in specialized technical areas as well as fulfill administrative duties as defined by support process Work with cross- functional teams during crisis to address and resolve complex incidents and problems in addition to assessment, analysis, and resolution of cross- functional issues. Recognizes and identifies potential areas where existing policies and procedures associated with support requires improvement and helps in the process improvement activity Develop Metrics to Assess & Improve quality and effectiveness of the development team Qualifications Minimum qualifications Developer with 8 years of experience required Education: Bachelors degree in Computer Science, or equivalent Recent and relevant experience leading software development initiatives Excellent skills in Microsoft technologies, including C#, ASP.NET, Microsoft .NET Framework Excellent skills in JavaScript, Ajax, jQuery, angular.js, Bootstrap, CSS, CSS3, and HTML5, XML, SOAP, REST API, Web Services Strong skills in database technologies (Microsoft SQL Server or Oracle) including database development (T- SQL or PL/ SQL) Excellent knowledge of web architectural and design patterns Solid working knowledge of current technologies including Object Oriented analysis and design practices (Object modeling, use cases, activity diagrams, and UML) . Familiar with various forms of SSO and an understanding of security best practices such as OWASP Familiar with Software Development Life Cycle, various development methodologies, and able to independently participate in each phase. Ability to design and implement solutions that are reliable, scalable, and perform at a high- level to meet the service levels associated with mission- critical solutions. Proven analytical and problem- solving abilities with ability to anticipate and avoid problems. Ability to define and implement migration strategies from legacy systems to new architecture and technologies. Ability to manage / work well within a team environment that includes geographically distributed team members. Ability to work within tight deadlines and effectively prioritize and execute tasks in a high- pressure environment. Strong communication skills (verbal and written) and an ability to communicate with internal and external customers and all levels of management, including communicating technical information to nontechnical audiences. Ability to design and build flexible and extensible systems with focus on code reuse and generation. Experience with writing detailed technical specifications for developers; design, validate and execute software test plans. Preferred qualifications Technical o Development experience with Microsoft Visual Studio 2012 o Experience with Team Foundation Server (TFS) o Experience with responsive and/ or adaptive design o Experience with progressive enhancement o Familiarity with NoSQL solutions such as Redis o Familiarity with Service Bus architecture o Familiarity with content management solutions/ frameworks such as Kentico, WordPress and/ or DotNetNuke Non- Technical: o Experience in automotive marketing o Excellent Analytical and problem solving skills o Ability to diagnose and troubleshoot problems quickly o Motivated to learn new applications and domains o Strong time management skills o Ability to take full ownership of tasks and projects o Experience with Agile/ SCRUM process Behavioral Attributes: o Team player with excellent interpersonal skills o Excellent verbal and written communication o Possess Can- Do attitude to overcome challenges o Self- motivated and directed Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Team Lead/Technical Lead Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AllianceData AllianceData Download PPT Photo 1   View Contact Details",
    "jobid": 310316506321,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Lead .NET / Database Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-31 07:24:31 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "04be107f945aa9448b65a9ded018d9b6"
  },
  {
    "company": "AllianceData",
    "education": "UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Summary This position is responsible for developing, implementing and maintaining .net based applications and components for the automotive marketing platform. Duties and responsibilities Responsible for maintenance of applications with technologies such as .NET C#/ SQL Server/ Oracle/ jQuery/ HTML5/ Javascript/ Angular/ Bootstrap. Collaborate with developers and business analysts in developing new software applications and enhancements. Assist in the definition, development, and documentation of softwares objectives, business requirements, deliverables, and specifications in collaboration with internal users and departments. Develop technical documentation to define the system components, development environment and implementation planning/ strategies Collaborate with QA team to define test cases, metrics, and resolve questions about test results. Develops and implements solutions in accordance with policies and procedures. Analyze user requests and assist with design activities. Provide strong technical specialty and knowledge to the team. Develop components based on business and/ or application requirements Create unit tests in accordance with team policies & procedures Assist in the creation of functional tests under the direction of superiors Work with cross- functional teams during crisis to address and resolve complex incidents and problems in addition to assessment, analysis, and resolution of cross- functional issues. Qualifications Minimum qualifications Developer with 2- 4 years of experience required Education: Bachelors degree in Computer Science, or equivalent Recent and relevant experience leading software development initiatives Strong skills in Microsoft technologies, including C#, ASP.NET, Microsoft .NET Framework Strong skills in JavaScript, Ajax, jQuery, angular.js, Bootstrap, CSS, CSS3, and HTML5, XML, SOAP, REST API, Web Services Good skills in database technologies (Microsoft SQL Server or Oracle) including database development (T- SQL or PL/ SQL) Strong knowledge of web architectural and design patterns Solid working knowledge of current technologies including Object Oriented analysis and design practices (Object modeling, use cases, activity diagrams, and UML) . Familiar with Software Development Life Cycle, various development methodologies, and able to independently participate in each phase. Ability to design and implement solutions that are reliable, scalable, and perform at a high- level to meet the service levels associated with mission- critical solutions. Proven analytical and problem- solving abilities with ability to anticipate and avoid problems. Ability to implement migration strategies from legacy systems to new architecture and technologies. Ability to work well within a team environment that includes geographically distributed team members. Ability to work within tight deadlines and effectively prioritize and execute tasks in a high- pressure environment. Strong communication skills (verbal and written) and an ability to effectively communicate technical information to other development team members Ability to design and build flexible and extensible systems with focus on code reuse and generation. Experience with writing detailed technical specifications for developers; design, validate and execute software test plans. Preferred qualifications Technical o Development experience with Microsoft Visual Studio 2012 o Experience with Team Foundation Server (TFS) o Experience with responsive and/ or adaptive design o Experience with progressive enhancement o Familiarity with NoSQL solutions such as Redis o Familiarity with Service Bus architecture o Familiarity with various forms of SSO and an understanding of security best practives (such as OWASP) o Familiarity with content management solutions/ frameworks such as Kentico and WordPress and DotNetNuke Non- Technical: o Experience in automotive marketing o Excellent Analytical and problem solving skills o Ability to diagnose and troubleshoot problems quickly o Motivated to learn new applications and domains o Strong time management skills o Ability to take full ownership of tasks and projects o Experience with Agile/ SCRUM process Behavioral Attributes: o Team player with good interpersonal skills o Good verbal and written communication o Possess Can- Do attitude to overcome challenges o Self- motivated and directed Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AllianceData AllianceData Download PPT Photo 1   View Contact Details",
    "jobid": 310316506297,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "DOT NET / Database Developer 2",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-31 07:24:27 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "bc61c88f10dd6a677433643fcef1a858"
  },
  {
    "company": "LiteLabs",
    "education": "UG: B.Tech/B.E. - Computers PG:M.Tech - Computers Doctorate:Doctorate Not Required",
    "experience": "3 - 4 yrs",
    "industry": "Internet / Ecommerce",
    "jobdescription": "Job Description   Send me Jobs like this Job Description As a Software Engineer in this team, you will be responsible for the design and development of highly interactive Cocoa applications for both iOS and Mac OS X. This is a team that prides itself in delivering high quality applications in a timely manner. The successful candidate will be comfortable working in a fast-paced, collaborative and start-up like environment. Developing and fostering partnerships with cross-functional teams is key to long-term success. The person filling this position must be a hands-on, pro-active, self-motivated developer with strong initiative and a desire to succeed in a challenging environment. This is a high visibility role where you will be communicating extensively with the UX team, business analyst teams, support teams, infrastructure teams and various other engineering teams including Maps, iOS and CoreOS. Salary: Not Disclosed by Recruiter Industry: Internet / Ecommerce Functional Area: IT Software - Mobile Role Category:Programming & Design Role:Software Developer Keyskills IOS Cocoa Design Development Software Engineering Business Analysis Desired Candidate Profile Education- UG: B.Tech/B.E. - Computers PG:M.Tech - Computers Doctorate:Doctorate Not Required Key Qualifications Objective-C development IOS SDK and OS X development User Interface Design Mobile and Desktop app development Familiarity with Networking Experience with Continuous integration, unit testing and test driven development Possess excellent software architecture, design, and problem solving skills Ability to work effectively with engineers, cross-functional teams and business partners to develop high-quality applications Excellent written and verbal communication skillsEducation: B.S. or M.S. in Computer Science with at least 3 years of industry experience Company Profile: LiteLabs LiteLabs is a startup and innovation lab that focuses on solving large scale problems driven by technology and entrepreneurial zeal. The LiteLabs team comes up with several ideas to test and experiment. These projects get prototyped through in-house design and technology teams, and are pilot tested on the ground to get feedback and market validation. Download PPT Photo 1   View Contact Details",
    "jobid": 280316901451,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "IOS Engineer - Startup",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-30 17:04:41 +0000",
    "site_name": "",
    "skills": "IT Software - Mobile",
    "uniq_id": "bff72cd64601a83d2952e34ad03565a1"
  },
  {
    "company": "AllianceData",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "4 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Summary This position is responsible for developing, implementing and maintaining .net based applications and components for the automotive marketing platform. Duties and responsibilities Responsible for maintenance of applications with technologies such as .NET C#/ SQL Server/ Oracle/ jQuery/ HTML5/ Javascript/ Angular/ Bootstrap. Collaborate with developers, project managers, business analysts and business users in conceptualizing, estimating and developing new software applications and enhancements. Assist in the definition of software development project plans, including scoping, scheduling, providing time estimates for programming tasks and implementation plans. Assist in the definition, development, and documentation of softwares objectives, business requirements, deliverables, and specifications in collaboration with internal users and departments. Develop technical documentation to define the system components, development environment and implementation planning/ strategies Prepare and dispense work assignments, provide guidance, and/ or review the work of other team members. Collaborate with QA team to define test cases, metrics, and resolve questions about test results. Recommend business process flow improvements and clearly communicate problem/ resolution process to project management. Develops and implements solutions in accordance with policies and procedures. Assist in the design and implementation process for new products/ projects, informing senior executive of alternatives. Analyze user requests and assist with design activities. Provide in- depth and strong technical specialty and knowledge to the team. Develop components based on business and/ or application requirements Create unit tests in accordance with team policies & procedures Assist in the creation of functional tests in cooperation with the QA team Advise, and mentor team members in specialized technical areas as well as fulfill administrative duties as defined by support process Work with cross- functional teams during crisis to address and resolve complex incidents and problems in addition to assessment, analysis, and resolution of cross- functional issues. Recognizes and identifies potential areas where existing policies and procedures associated with support requires improvement and helps in the process improvement activity. Qualifications Minimum qualifications Developer with 4- 8 years of experience required Education: Bachelors degree in Computer Science, or equivalent Excellent skills in Microsoft technologies, including C#, ASP.NET, Microsoft .NET Framework Excellent skills in JavaScript, Ajax, jQuery, angular.js, Bootstrap, CSS, CSS3, and HTML5, XML, SOAP, REST API, Web Services Strong skills in database technologies (Microsoft SQL Server or Oracle) including database development (T- SQL or PL/ SQL) Excellent knowledge of web architectural and design patterns Solid working knowledge of current technologies including Object Oriented analysis and design practices (Object modeling, use cases, activity diagrams, and UML) . Familiar with various forms of SSO and an understanding of security best practices such as OWASP Familiar with Software Development Life Cycle, various development methodologies, and able to independently participate in each phase. Ability to design and implement solutions that are reliable, scalable, and perform at a high- level to meet the service levels associated with mission- critical solutions. Proven analytical and problem- solving abilities with ability to anticipate and avoid problems. Ability to define and implement migration strategies from legacy systems to new architecture and technologies. Ability to work well within a team environment that includes geographically distributed team members. Ability to work within tight deadlines and effectively prioritize and execute tasks in a high- pressure environment. Strong communication skills (verbal and written) and an ability to communicate with internal and external customers and all levels of management, including communicating technical information to nontechnical audiences. Ability to design and build flexible and extensible systems with focus on code reuse and generation. Experience with writing detailed technical specifications for developers; design, validate and execute software test plans. Preferred qualifications Technical o Development experience with Microsoft Visual Studio 2012 o Experience with Team Foundation Server (TFS) o Experience with responsive and/ or adaptive design o Experience with progressive enhancement o Familiarity with NoSQL solutions such as Redis o Familiarity with Service Bus architecture o Familiarity with content management solutions/ frameworks such as Kentico, WordPress and/ or DotNetNuke Non- Technical: o Experience in automotive marketing o Excellent Analytical and problem solving skills o Ability to diagnose and troubleshoot problems quickly o Motivated to learn new applications and domains o Strong time management skills o Ability to take full ownership of tasks and projects o Experience with Agile/ SCRUM process Behavioral Attributes: o Team player with excellent interpersonal skills o Strong verbal and written communication o Possess Can- Do attitude to overcome challenges o Self- motivated and directed Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AllianceData AllianceData Download PPT Photo 1   View Contact Details",
    "jobid": 310316506296,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Senior .NET / Database Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-31 07:24:23 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "4d6dad1e13bf6972ff0c37f92a52625d"
  },
  {
    "company": "AllianceData",
    "education": "UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "4 - 8 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this Summary This position is responsible for developing, implementing and maintaining .net based applications and components for the automotive marketing platform. Duties and responsibilities Responsible for maintenance of applications with technologies such as .NET C#/ SQL Server/ Oracle/ jQuery/ HTML5/ Javascript/ Angular/ Bootstrap. Collaborate with developers, project managers, business analysts and business users in conceptualizing, estimating and developing new software applications and enhancements. Assist in the definition of software development project plans, including scoping, scheduling, providing time estimates for programming tasks and implementation plans. Assist in the definition, development, and documentation of softwares objectives, business requirements, deliverables, and specifications in collaboration with internal users and departments. Develop technical documentation to define the system components, development environment and implementation planning/ strategies Prepare and dispense work assignments, provide guidance, and/ or review the work of other team members. Collaborate with QA team to define test cases, metrics, and resolve questions about test results. Recommend business process flow improvements and clearly communicate problem/ resolution process to project management. Develops and implements solutions in accordance with policies and procedures. Assist in the design and implementation process for new products/ projects, informing senior executive of alternatives. Analyze user requests and assist with design activities. Provide in- depth and strong technical specialty and knowledge to the team. Develop components based on business and/ or application requirements Create unit tests in accordance with team policies & procedures Assist in the creation of functional tests in cooperation with the QA team Advise, and mentor team members in specialized technical areas as well as fulfill administrative duties as defined by support process Work with cross- functional teams during crisis to address and resolve complex incidents and problems in addition to assessment, analysis, and resolution of cross- functional issues. Recognizes and identifies potential areas where existing policies and procedures associated with support requires improvement and helps in the process improvement activity. Qualifications Minimum qualifications Developer with 4- 8 years of experience required Education: Bachelors degree in Computer Science, or equivalent Excellent skills in Microsoft technologies, including C#, ASP.NET, Microsoft .NET Framework Excellent skills in JavaScript, Ajax, jQuery, angular.js, Bootstrap, CSS, CSS3, and HTML5, XML, SOAP, REST API, Web Services Strong skills in database technologies (Microsoft SQL Server or Oracle) including database development (T- SQL or PL/ SQL) Excellent knowledge of web architectural and design patterns Solid working knowledge of current technologies including Object Oriented analysis and design practices (Object modeling, use cases, activity diagrams, and UML) . Familiar with various forms of SSO and an understanding of security best practices such as OWASP Familiar with Software Development Life Cycle, various development methodologies, and able to independently participate in each phase. Ability to design and implement solutions that are reliable, scalable, and perform at a high- level to meet the service levels associated with mission- critical solutions. Proven analytical and problem- solving abilities with ability to anticipate and avoid problems. Ability to define and implement migration strategies from legacy systems to new architecture and technologies. Ability to work well within a team environment that includes geographically distributed team members. Ability to work within tight deadlines and effectively prioritize and execute tasks in a high- pressure environment. Strong communication skills (verbal and written) and an ability to communicate with internal and external customers and all levels of management, including communicating technical information to nontechnical audiences. Ability to design and build flexible and extensible systems with focus on code reuse and generation. Experience with writing detailed technical specifications for developers; design, validate and execute software test plans. Preferred qualifications Technical o Development experience with Microsoft Visual Studio 2012 o Experience with Team Foundation Server (TFS) o Experience with responsive and/ or adaptive design o Experience with progressive enhancement o Familiarity with NoSQL solutions such as Redis o Familiarity with Service Bus architecture o Familiarity with content management solutions/ frameworks such as Kentico, WordPress and/ or DotNetNuke Non- Technical: o Experience in automotive marketing o Excellent Analytical and problem solving skills o Ability to diagnose and troubleshoot problems quickly o Motivated to learn new applications and domains o Strong time management skills o Ability to take full ownership of tasks and projects o Experience with Agile/ SCRUM process Behavioral Attributes: o Team player with excellent interpersonal skills o Strong verbal and written communication o Possess Can- Do attitude to overcome challenges o Self- motivated and directed Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. PG:M.Tech Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AllianceData AllianceData Download PPT Photo 1   View Contact Details",
    "jobid": 310316506333,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Senior .NET / Angular / Database Developer",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-31 07:24:06 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "8fd18b4287e1945b93e6794d66a11012"
  },
  {
    "company": "AllianceData",
    "education": "UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required",
    "experience": "2 - 4 yrs",
    "industry": "IT-Software / Software Services",
    "jobdescription": "Job Description   Send me Jobs like this The Software Developer 2 Custom (Harmony) is someone that is comfortable working with / supporting API solution development and integrations as well as databases marketing applications and solutions. Duties and Responsibilities: Responsible for design, development, deployment, and production support for API, middle tier and database solutions Interact with RESTful and SOAP API?s, service layer, batch file import and extract, and web based applications Focus on developing in a multi- tiered environment Design and develop software to support real time transactions Minimum Qualifications: 2- 4 years experience Bachelors Degree or equivalent experience required 1- 3 years development experience Visual Studio.NET 2008- 2012, C# 1- 3 years of experience working with .net framework (3.5 or higher preferred) 1 years invoking and hosting WCF (svc) / Web Services (asmx) / Web API required 1 years of web based application development experience required (HTML, ASP, ASP.NET, AJAX, JavaScript, JQuery, XML, XSLT, CSS) 1 years of experience with ADO.NET 1 years developing ASP.NET MVC 3 (or higher) applications is preferred Strong Object development skills and experience is required Entity Framework experience required The ability to work in a team environment is necessary Prior experience with enterprise class application development is a plus Strong OOPS concepts, problem solving and SQL skills are required Preferred Qualifications: Understanding and experience in service oriented architecture designs (SOA) Knowledge of design patterns is a plus Experience with HTML5, media query or mobile applications is preferred Experience in Web Services/ XML/ Multithreading Strong SQL Skills (SQL Server preferred) Marketing technology experience is a plus Position involves little or no travel Salary: Not Disclosed by Recruiter Industry: IT-Software / Software Services Functional Area: IT Software - Application Programming , Maintenance Role Category:Programming & Design Role:Software Developer Desired Candidate Profile Education- UG: B.Tech/B.E. PG:Post Graduation Not Required Doctorate:Any Doctorate - Any Specialization, Doctorate Not Required Please refer to the Job description above Company Profile: AllianceData AllianceData Download PPT Photo 1   View Contact Details",
    "jobid": 310316506311,
    "joblocation_address": "Bengaluru/Bangalore",
    "jobtitle": "Software Developer 2 (Harmony)",
    "numberofpositions": "",
    "payrate": "Not Disclosed by Recruiter",
    "postdate": "2016-03-31 07:24:30 +0000",
    "site_name": "",
    "skills": "IT Software - Application Programming",
    "uniq_id": "7e15aa663486022a77d42fd3897b2ef3"
  }
]
